{
    "ETH": [
        "Time to buy Stocks are at great prices. I hope you all arent sitting on your hands. PayPal trading where it was in 2017? Laughable. Meta at $180? Are you kidding me? BTC and ETH are down like 60% so if youre into crypto and have wanted to get in nows your chance. The nasdaq is down like 30%. Snp is almost back in bear market. Its the worst start to a year since the Great Depression I think. Dont get me wrong we have problems. But the stock market will most likely bottom before the problems end as it usually is quite forward looking. Example: stock market bottomed in 2009. Real estate bottomed and unemployment peaked in like 2011. Youve always heard the classic saying be greedy when theres fear be fearful when theres greed. So now is your chance. Dont waste it Bear markets are few and far between",
        "During the crypto crash in 2018 Nvidia had 4 straight quarters of negative YoY revenue growth  24% in Q1 2019  30% in Q2 2019  17% in Q3 2019  5% in Q4 2019 Nvidias stock price dropped by about 53% during this period. It didnt recover until the pandemicfueled boom. This is because when crypto crashes miners will flood the market with used GPUs giving bargain prices to gamers. MSRP prices for gaming GPUs doubled during the boom. What happens when GPU prices drop to half of MSRP? In the last 3 months ETH mining profitability has dropped by 50%. 70% in the last 6 months. This doesnt even account for electricity cost inflation. ETH itself is down 30% in the last 7 days. Nvidia does not break out its gaming and crypto sales. They lump both categories into their gaming sales category. Therefore no one can reliably model the impact. But if I have to guess it wont be as bad as 2018 if crypto does not go back up because Nvidias overall revenue has diversified a bit since 2018. However 2018 is very different than 2022 for Nvidia. In 2018 Nvidia only faced the crypto crash. In 2022 Nvidia faces a triple whammy: recessionrisk GPUs are a nonessential good and expensive people going outside more less gaming and crypto crash mining. While some companies are facing one or two of these issues very few are impacted by all three. Like most tech companies during the pandemicboom Nvidia also hired a ton of workers and started projects that dont either dont make any money or loses money. Nvidias employee count went from 13000 to 22000 from 2020 to 2022. The question is is Wallstreet ready for negative Nvidia revenue growth? Do you think Wallstreet has already priced this in? Right now Nvidias PE is still at a premium over the market. What happens when its growth is negative for 4 quarters? Long term I still believe in Nvidia. But watch out in the next 12 years. amp;x200B;",
        "No Stocks Hit 52Week High Monday; Financial Services Leads 52Week Lows During trading Monday 205 stocks bottomed out at new 52week lows. The Samp;P 500 is down 3.81% so far today while the Dow is down 2.74% the Nasdaq is down 4.56% and the Russell 2000 is down 4.97%. Markets are down big Monday with cryptos crashing as Bitcoin BTC is below $24000 and Ethereum ETH has fallen under $1300. Investors are pricing in a potential 75 basis point interest rate hike for the Feds next meeting following a worse than expected CPI report on Friday which showed overall prices rising 1.0% last month. In totality markets are pricing in a 175 basis point increase in rates by September. Sector Highlights Technology stocks dominated our list of highs today with 0 out of the 1 total stocks that reached their high coming from the Technology sector. The Technology sector is outperforming the market is flat 0% so far on the day. Over the last month the Technology sector has outperformed the market increasing 0% while the Samp;P decreased 6.48%. Technology: The Financial Services sector makes up the majority of our 52week lows as 44 out of our 205 lows comes from the Financial Services sector. The Financial Services sector is outperforming the market today decreasing 3.04% so far on the day. Over the last month the Financial Services sector has outperformed the market decreasing 5.26% while the Samp;P decreased 6.48%. Finance stocks have the most lows Monday with the sector falling over 3% today but has fallen less than the Samp;P 500 over the last month of trading still. Financial Services: ALLY AUB BAC BBDC BCSF BEN BK BKU BLX CFG CG CNS COF CPF CSWC EFSC EVR EWBC FAF FBNC FFBC FFIN FFWM FRC FRME GAIN GHL GS GSBD HMST HTGC IVZ JEF JHG KEY KKR LNC LOB MAIN MC MCO MORN MTG NAVI The Lists No stocks traded to a 52week high today. The following stocks traded to 52week lows: AAP AAT ABR ACCO ADS AKAM AKR ALGT ALLY AMAT AMCX AME AMKR AMRX ANSS APH ARAY ARDX ARE ARMK ARVN AUB AWI AZZ BAC BAND BBBY BBDC BBY BC BCSF BDN BEN BK BKU BLL BLX BXMT CAMT CATO CBRE CBRL CCK CDAY CDLX CDXS CENX CFG CG The following ETFs traded to a 52week high: TBT UUP VXZ The following ETFs traded to a 52week low: BWX CSJ CUT DIA EFA EGPT EIS EMB ENZL EPP EWA EWG EWI EWJ EWK EWM EWN EWQ EWS EWU EWY EZA EZU FDN FXB HYD HYG IAI IBB ICF IEF IEI IGN IHF IHI IOO ITB IWF IYF IYG IYH IYJ IYR IYT IYZ JNK KBE KCE KRE",
        "Which stocks to short if you believe the Crypto crash is just beginning Questions:  Do you think the bank runs happening at Celsius is a beginning of a chain reaction that can take down crypto stocks?  What are the best stocks/etfs to short?  Is ETH more vulnerable than bitcoin? If so are there miners that specialize in ETH we can short?  If you are personally shorting crypto stocks what is your current strategy? Of course I welcome counter opinions. Disclosure: I sold a naked call against Coinbase and bought a put on one of the crypto ETFs.",
        "CloudFlare for less risky exposure to Web3? Buying ETH would be opening yourself up to a ton of DeFi ponzis see: celsius terraluna... But CloudFlare offers a ETH gateway as well as an IPFS gateway both Web3 staples. Also: CloudFlare is used by gt;80% of websites and it has a larger market cap than the Samp;P500 internet infrastructure company Akamai. CloudFlare seems to have built a moat in the internet infrastructure space by offering superior products ex: cloud hosting cache security easy and free for personal use etc as well as covering most websites. CloudFlare also has a sticky customer base because changing your CMS often involves changing multiple APIs that depend on an always available see: CloudFlares superior cache site. CloudFlare has seen a huge uptick the past 5 days of 30% and it might be a huge player in the next bull market whenever that happens. Either its acquired enters the Samp;P or both. Thoughts?",
        "GBTC or ETHE? Do you think GBTC or ETHE is a better investment right now? Theyre both grayscale products but with different circumstances. GBTC: GBTC Got denied being turned into an ETF by SEC. Grayscale is sueing the SEC but the outcome might take up to two years. I feel like on the one hand this will tank GBTC even more so than ETHE and/or will keep its price growth down/widen the discount in comparison to BTC and ETH or ETH derived products like ETHE. On the other hand GBTC tanking more than ETHE could be a good buying opportunity. ETHE: If GBTC isnt going to become an ETF then no way in hell does ETHE have any chance either. However we knew that if ETHE was going to become an ETF that it would do so at a later time than GBTC and with this lawsuit its possible by the time a conclusion if favorable that ETHE becomes an ETF shortly after GBTC. With the ETH merge ETHE could also see a higher growth than BTC/GBTC and be a better overall investment. Thoughts?",
        "Buying the Nvidia dip? Reminder: During the crypto crash in 2018 Nvidia had 4 straight quarters of negative YoY revenue growth I wrote this 2 months ago and posted it here. I predicted the bad quarter. I wonder why Wallstreet didnt?  Original post below  24% in Q1 2019  30% in Q2 2019  17% in Q3 2019  5% in Q4 2019 Nvidias stock price dropped by about 53% during this period. It didnt recover until the pandemicfueled boom. This is because when crypto crashes miners will flood the market with used GPUs giving bargain prices to gamers. MSRP prices for gaming GPUs doubled during the boom. What happens when GPU prices drop to half of MSRP? In the last 3 months ETH mining profitability has dropped by 50%. 70% in the last 6 months. This doesnt even account for electricity cost inflation. ETH itself is down 30% in the last 7 days. Nvidia does not break out its gaming and crypto sales. Comment: Nvidia gaming revenue fell short by $1b They lump both categories into their gaming sales category. Therefore no one can reliably model the impact. But if I have to guess it wont be as bad as 2018 if crypto does not go back up because Nvidias overall revenue has diversified a bit since 2018. However 2018 is very different than 2022 for Nvidia. In 2018 Nvidia only faced the crypto crash. In 2022 Nvidia faces a triple whammy: recessionrisk GPUs are a nonessential good and expensive people going outside more less gaming and crypto crash mining. While some companies are facing one or two of these issues very few are impacted by all three. Like most tech companies during the pandemicboom Nvidia also hired a ton of workers and started projects that dont either dont make any money or loses money. Nvidias employee count went from 13000 to 22000 from 2020 to 2022. The question is is Wallstreet ready for negative Nvidia revenue growth? Do you think Wallstreet has already priced this in? Right now Nvidias PE is still at a premium over the market. What happens when its growth is negative for 4 quarters? Long term I still believe in Nvidia. But watch out in the next 12 years.",
        "First Portfolio $21k Im building my first long term portfolio with moderate risk for growth potential. Ive been comparing and researching and this is what Ive came up with so far. I have not put any money in yet Ive been wanting some 3rd party opinions. LMK below what you think.  $10000 VTI $4000  QQQM $2500 AVUV $1000 ETH $500 IHI Medical Device Sector $500 VGT Information Tech Sector $500 MA  $500 V  $250 SONY $250 MSFT $250 AAPL $250 GOOG $250 TSLA $250 AMZN $250 META",
        "TreasuryDirect Alternatives? Hi all I just created a TreasuryDirect account to put $ in IBonds and they couldnt verify my information likely because I just moved addresses. They are saying I likely wont have account access for 13 freaking weeks. I have a substantial amount of savings that Im trying to put to use in a low risk way and that seemed like my best bet especially before they lower the rates at the end of October. Most of my investments are in broad market funds like VOO or in BTC/ETH and I have a mediumlong term holding horizon. Has anyone had experience getting their account verified promptly? Any suggestions for similar investments that dont require a TreasuryDirect account? TIA UPDATE: Even with Yotta they were unable to make an account for me because they also go through TD.",
        "What would you do with a lump sum of money right now? Are financial advisors worth it? Theres a chance that my small business is getting bought out..which means I may get an opportunity to finally have a decent amount of cash on hand. What would you do with a lump sum of money right now? I plan on doing the following: Paying off all credit cards and student loans Putting a chunk into mutual funds/low risk investments Putting some into a high interest savings account putting some into etfs  remodeling my bathroom  possibly buying a rental property maybe waiting until home prices continue to decrease  throw some into crypto specially bitcoin and ETH? Are financial advisors really worth it if you plan on playing it somewhat safe? EDIT: So Ive gotten some followup questions...  This would potentially be a 400k payout pre capitalgains tax This is my side business. I have a fulltime job that has great benefits and compensation.  I would immediately do the following: pay off all debts max out my benefits with fulltime job 401k HSA Employee Stock purchase program My follow up question to the rest of the forum: Are Financial Advisors primarily meant to help you out with taxes? Or they really really worth it if want to grow your net worth? I feel like I have a lowrisk mentality yes i know I mentioned crypto but Im talkin less than 5% of all my investments. A few people here have said Financial Advisors just help you out with taxes so curious to hear more on that. How much do Financial Advisors normally take from you?"
    ],
    "BTC": [
        "Time to buy Stocks are at great prices. I hope you all arent sitting on your hands. PayPal trading where it was in 2017? Laughable. Meta at $180? Are you kidding me? BTC and ETH are down like 60% so if youre into crypto and have wanted to get in nows your chance. The nasdaq is down like 30%. Snp is almost back in bear market. Its the worst start to a year since the Great Depression I think. Dont get me wrong we have problems. But the stock market will most likely bottom before the problems end as it usually is quite forward looking. Example: stock market bottomed in 2009. Real estate bottomed and unemployment peaked in like 2011. Youve always heard the classic saying be greedy when theres fear be fearful when theres greed. So now is your chance. Dont waste it Bear markets are few and far between",
        "Can anything be meaningfully deduced from BTC  Tesla still being high in terms of retail sentiment? 1. Tesla is still 13% past 12 months with a 94x P/E and a market cap of $720b this topic has been done to death; we dont need to get into it. Theyre an awesome company their future growth story is amazing their historical growth and returns are awinspiring but these levels to me personally show that... retail has not pulled their money yet. I dont have data on who/what is propping Tesla up price wise but I think its fair to say its very close to GME/AMC memestock levels valuation wise. However institutional ownership is about 42% if that report is accurate/means anything but Im sure a portion of that is because its in a lot of Samp;P500 ETFs. Should they be worth more than every automaker combined when were about to enter a period of time of stagflation GDP gonna go down because inflation eating into earnings/savings of regular Joes who no longer can afford to finance a $40k$60k Tesla 2. BTC/USD is still $28k$30k and has been holding that level for about a full month now. Crypto probably has a place in the future but the BTC technology and all of its layers are probably not going to remain dominant for the next 5 years let alone 50. Crypto isnt really being used at large scale for things like... paying for groceries/gas/ordering food/buying stuff online. Does a small subset of people use it for random stuff? Yeah. Do they do it almost exclusively inside of heavily regulated exchanges? Pretty much. This alone tells me it isnt as good as a credit card for transactions and it isnt unregulated or decentralized or anonymous like original crypto claims. Why anybody is still FOMOing/holding on... I dont know. I believe they deserve to be shaken out punished for gambling hoping an asset like Bitcoin makes them money despite not bringing any real value to the world arguably being a mild contributor to climate change due to all of the computational power used. Is crypto really a net positive on society right now? has it been past 1236 months? If not why is it worth $30k? It shouldnt be. When we see BTC $20k$25k or lower and TSLA down another 20% 13% to give up the gains for the past 12 months it has held onto and 78% more to match what the Samp;P has done so far I think Ill feel better about the stock market. I could 100% be wrong and BTC could got to $100k and Tesla is going to do a 3:1 split and run up another 1000%. I just dont think those two things are founded on any sound fundamentals thats all. And because of that I dont think max pain has hit the market yet. There hasnt been a flush where the little guy gets wiped out like picking Dotcom stocks back in 2000 and evil hedge fun Wall Street prevails/captures all of their money like a Vegas casino.",
        "No Stocks Hit 52Week High Monday; Financial Services Leads 52Week Lows During trading Monday 205 stocks bottomed out at new 52week lows. The Samp;P 500 is down 3.81% so far today while the Dow is down 2.74% the Nasdaq is down 4.56% and the Russell 2000 is down 4.97%. Markets are down big Monday with cryptos crashing as Bitcoin BTC is below $24000 and Ethereum ETH has fallen under $1300. Investors are pricing in a potential 75 basis point interest rate hike for the Feds next meeting following a worse than expected CPI report on Friday which showed overall prices rising 1.0% last month. In totality markets are pricing in a 175 basis point increase in rates by September. Sector Highlights Technology stocks dominated our list of highs today with 0 out of the 1 total stocks that reached their high coming from the Technology sector. The Technology sector is outperforming the market is flat 0% so far on the day. Over the last month the Technology sector has outperformed the market increasing 0% while the Samp;P decreased 6.48%. Technology: The Financial Services sector makes up the majority of our 52week lows as 44 out of our 205 lows comes from the Financial Services sector. The Financial Services sector is outperforming the market today decreasing 3.04% so far on the day. Over the last month the Financial Services sector has outperformed the market decreasing 5.26% while the Samp;P decreased 6.48%. Finance stocks have the most lows Monday with the sector falling over 3% today but has fallen less than the Samp;P 500 over the last month of trading still. Financial Services: ALLY AUB BAC BBDC BCSF BEN BK BKU BLX CFG CG CNS COF CPF CSWC EFSC EVR EWBC FAF FBNC FFBC FFIN FFWM FRC FRME GAIN GHL GS GSBD HMST HTGC IVZ JEF JHG KEY KKR LNC LOB MAIN MC MCO MORN MTG NAVI The Lists No stocks traded to a 52week high today. The following stocks traded to 52week lows: AAP AAT ABR ACCO ADS AKAM AKR ALGT ALLY AMAT AMCX AME AMKR AMRX ANSS APH ARAY ARDX ARE ARMK ARVN AUB AWI AZZ BAC BAND BBBY BBDC BBY BC BCSF BDN BEN BK BKU BLL BLX BXMT CAMT CATO CBRE CBRL CCK CDAY CDLX CDXS CENX CFG CG The following ETFs traded to a 52week high: TBT UUP VXZ The following ETFs traded to a 52week low: BWX CSJ CUT DIA EFA EGPT EIS EMB ENZL EPP EWA EWG EWI EWJ EWK EWM EWN EWQ EWS EWU EWY EZA EZU FDN FXB HYD HYG IAI IBB ICF IEF IEI IGN IHF IHI IOO ITB IWF IYF IYG IYH IYJ IYR IYT IYZ JNK KBE KCE KRE",
        "Looking to buy into market now have been sitting on cash since the crash. What do you think of my planned buys? I have around 27.5 to put in now with about 50 more to put in a couple of months. How does this allocation look? FNGU  1k TQQQ 2k SPY  9k TSLA  3k QQQ  4K AMZN  3k BTC  5k Thank you for any input",
        "GBTC or ETHE? Do you think GBTC or ETHE is a better investment right now? Theyre both grayscale products but with different circumstances. GBTC: GBTC Got denied being turned into an ETF by SEC. Grayscale is sueing the SEC but the outcome might take up to two years. I feel like on the one hand this will tank GBTC even more so than ETHE and/or will keep its price growth down/widen the discount in comparison to BTC and ETH or ETH derived products like ETHE. On the other hand GBTC tanking more than ETHE could be a good buying opportunity. ETHE: If GBTC isnt going to become an ETF then no way in hell does ETHE have any chance either. However we knew that if ETHE was going to become an ETF that it would do so at a later time than GBTC and with this lawsuit its possible by the time a conclusion if favorable that ETHE becomes an ETF shortly after GBTC. With the ETH merge ETHE could also see a higher growth than BTC/GBTC and be a better overall investment. Thoughts?",
        "Tesla did not sell their BTC at a loss As with anything Tesla Im seeing lots of comments containing false information getting upvotes saying they bought high and sold low or made a big loss on their Bitcoin. I just wanted to clarify that this is not the case: Tesla sold 10% of their total BTC in March 2021 as a liquidity test at a profit $100M as per their 10Q. Then they sold 75% of their remaining BTC this quarter in May at around the same price they bought it for. On the EC they mentioned they made a slight profit but it was offset by their impairment. As for that the way BTC accounting works is that you are not allowed to recognise any profits until you sell. So if you buy at $10k and BTC goes to $100k the profit in your books is $0. Once you sell you are allowed to recognise that profit. On the other hand if it drops below your carrying value you do need to recognise that impairment. So if you bought for $10k and it drops to $5k you need to take a $5k loss on your earnings. If after that it goes back to $10k youre still carrying it for $5k until you sell. Youre not allowed to recoup your losses in the books until you sell. If at any point it goes below the lowest its been while you were holding it so $5k in this example you again need to take an impairment in your books. As a result Tesla had to mark down their carrying value in Q3 2021 as BTC dropped to $30K which was their carrying value until Q2 and right around where they sold. So in short they made a small profit on the 75% they sold this quarter but because the other 25% dropped roughly 35% below their carrying value to $17760 generating a $115M impairment again can just calculate this based on the earnings report that offset the gains from the other 75%. Overall theyre still up roughly $100M from their first sale and another $60M from the remaining 25% because BTC is now 30% higher than their carrying value. Tl;dr: Teslas net gains on BTC realised  unrealised is $160M.",
        "Tesla Earnings  some perspective Tesla rallied 10% yeterday post earnings. A move we have not seen in a while. Tesla long held the mantle of poster boy in the US 2020/21 tech rally fanned my the biggest monetary expansion in history. Does its rally herald a comeback in tech or is it one last dead cat bounce for the most overhyped and overpriced stock in history? To be fair to Tesla there was some misreporting of Free Cash Flows being negative without its BitCoin sales. Not true FCF = Operating Cash Flows  CapEx so the $621 million free cash flow was true the BTC sale an investment cash flow. That said the $0.8 billion reported net change in cash would have been negative without the BTC sale  which of course saw some loss of credibility to Musk given previous comments on the subject. Perhaps a better understanding of the motivation for that decision on cash by its CEO and CFO can be helped by seeing the fall in free cash flows: 3Q21: $1328M 4Q21: $2775M 1Q22: $2228 2Q22: $621 On a quarterly and trailing 12 month basis Tesla announced: Revenues of $16.93 billion $67.166 billion 12 month ttv Net GAAP profits of $2.259 billion $9.516 billion 12 month ttv Free Cash Flow of $621 million $6.952 billion 12 month ttv Tesla trades then at: 13 x Price to sales; 89 x Price to earnings; 122 x Price to FCF Heady numbers but Tesla is of course a growth stock and all about its future earnings potential in EV cars semis pickups robotaxis business to business/customer tech sales battery sales and artificial intelligence. Lets take a look at those areas vs its competitors... China and Europes large automobile markets 26 and 12 million sales in 2021 now have 1 in 5 cars sold as plugins BEV/PHEVs unlike the US mkt still showing only 1 in 20 EV sales from the 15 million vehicles sold in 2021. Tesla of course dominates US EV sales. It no longer does global markets outside of the US. BYD is now the leading global seller of EVs for those investors not paying attention yes that includes hybrids but increasingly dominated by BEVs:  Whilst Tesla still tops individual BEV model lists its sales are only really across two models now S and X sales very slight. VW group presently trading at a measely $85 billion market cap vs Teslas $845 despite selling 8.6 million cars in 2021 for example produces over a dozen EV models across Audi etron; etron Sportback; etron GT Man electric semis Porsche Taycan Seat Cupra Born Skoda Enyaq/Enyaq Coupe and VW ID3; ID4; ID5; eup; egolf brands. Tesla was surpassed in EV sales by company in 2021 in China and Europe and has now been globally in 2022 It is no wonder with the sheer numbers and quality of alternative models of EVs on sale outside of US markets for example in China the Xpeng P7 has proven a fierce rival to Tesla particularly models coming with LIDAR along with the BYD Han essentially both midrange luxury sedans the equivalents of a Tesla Model S for the price of a Model 3.  Whilst Tesla kept Cap Ex to almost maintenance levels in 2020 to help become cash flow positive Xpeng aggressively ploughs cash inflows into Ramp;D. Hence Xpeng now offers far superior hardware including LIDAR in its self drive hardware/software package for a lot less money: XPeng XPilot: $3900; 2 LiDAR; 5 radar; 12 sonic sensors; 12 cameras Tesla FSD: $10000; no LiDAR; 1 radar; 12 sonic sensors; 8 cameras Whilst investors eagerly await the production of the Tesla semi first revealed in 2017 and the Cybertruck first revealed in 2019 and its market lead on EV trucking BYD Daimler MAN and Volvo etc have long been selling them in global markets including the US:  Whilst Tesla robotaxis have gone quiet and NHSTA oversight looms Apollo Baidu selfdriving taxis are up and running in Beijing WITHOUT accompanied human drivers  genuine FSD level 5. Waymo meanwhile has been offering driverless taxis in Phoenix to employees since 2020:  Whilst Tesla is apparently the market leader in lithium battery technology the long founded rumours have finally been confirmed BYD is going to supply Tesla with batteries:  Whilst we still await Teslas superior autochips companies like Infineon NXP and Renesas have always led the market supplying companies like XPeng and Tesla and providing ever improving technology like systems on a chip for selfdriving:   No alas Tesla just remains all hype and the last US tech bubble to fall to anywhere near its realistic future earnings valuation as other US and overseas companies plough far ahead of it in most areas that myopic Tesla investors who lack any global perspective expect Tesla to lead the world.",
        "Inflation on your mind? Here are some TIPS for you Turns Out Hawkish Jay Might Be Transitory?  Were all very aware of inflation.  Most people have felt it at least a little in their lives from gas prices groceries rent staples travel and so on.  Some investors and traders expect inflation to be persistent and uncomfortably high for a while.  They might even be very bullish on the market in the mediumterm but want to have at least some cash to ride out volatility for an emergency or hedge against potential large declines. They may feel forced into a false dichotomy that either they have to see cash burn in real terms or speculate on the shortterm direction of the market.  Turns out there are ways to potentially protect your cash if inflation ends up being more persistent than we all think.  One of those solutions is TIPS  aka Treasury InflationProtected Securities.  Who are examples of people that might consider buying them?  Someone looking to park cash to make a large purchase of some kind next year that can remain illiquid until that time but concerned that inflation will be very high.  Someone bullish looking to hedge a highly growth tilted portfolio  keeping some dry powder on the side.  Older investors looking to protect the value of cash expecting interest rates to rise further.  Bearish trader speculating on a market decline but not wanting to go allin the high risk of shorting the market either directly or with options. How do they work? TIPS are just like regular Treasury bonds.  They have a fixed coupon rate that is applied to its face value twice a year to pay interest.  The key difference however is that the face value or principal is continually updated to reflect changes in the CPIU index the general urban CPI index we are all familiar with on the news. TIPS are issued and auctioned by the US Treasury in 5 10 and 30 year terms.  Since their scheduled auction and maturity dates have effectively been scattered throughout the year you will always be able to find whatever term you are looking for and they can be purchased from your broker.  Accrued Principal The adjusted principal or accrued principal is the most important part of a TIPS bond.  The way it is calculated is by multiplying the original face value by the CPI Index Ratio also called inflation factor.  It is equal to the current CPI divided by the CPI index when the bond was issued.  Thus Index Ratio = Reference CPI current date / Reference CPI issue date. These index ratios can be verified and calculated just using BLS data  but the Treasury also just publishes them for you.  Most brokers will include all this data on their client portal or trading UI.  Heres an example of a TIPS bond with the following ID CUSIP  912828UH1   It has three key dates 1 Issue date 2 Dated date 3 Maturity date.  The issue and maturity is the same as a regular bond.  The Dated date is the reference date to begin the CPI calculation often middle of the month a couple weeks before the bond was auctioned usually Jan 15th or Aug 15th. For this bond the dated date CPI is 230.82203 the CPI on January 15 2013.  The CPI today is 291.88477 the daily reference CPI.  So the index ratio or inflation factor is 291.88477/230.82203 = 1.26454.  Hence the adjusted principal for each $1000 of face value is $1264.54. The adjusted principal is key because that moving balance is basically what coupon rates will be applied to on coupon dates and finally whatever it has climbed to is what you receive at maturity.  It is fairly straightforward and intuitive but there is one small but very important detail to be aware of.  The CPI reference is lagging behind by three months.  That means that the dated date CPI at issue is 1/15/2013 but in reality the CPI used is 10/15/2012.  Similarly the reference daily CPI today is actually 4/27/2022 not 7/27/2022 today  I am not sure what the reason for this is but if I had to guess it is because of data lags that used to exist and the time needed to publish CPI. In any case this means that if you buy TIPS today they do not yet include hot months of May June and anything that happened in July  Since CPI is published by month a simple linear interpolation straight average is used to calculate CPI days between months. Effective Yield Finally the effective yield is what you would expect on an annualized basis assuming consumer prices were completely stable going forward.  It is determined the exact same way as a regular bond except the face value is the current daily accrued principal.  The Wall Street Journal has a nice table of all TIPS yields if someone knows of a better table to compare yields please let me know.  Today yields went down quite a bit based upon what was perceived as dovish Fed guidance which one would expect to be inflationary.  But if you look at the April 15 2024 TIPS it has a yield of .18% which is close to 0.  That means that most of the gain from this bond will be from inflation.  If somehow inflation were 0 from here you would basically break even.  A regular Treasury bond with a maturity of 4/15/24 has a yield of 3.034%.  The difference between these two numbers can be used to calculate the breakeven rate.  3.034.18 = 3.214% is the markets expected annualized rate of inflation for the next 21 months. This is the critical number to look at when placing your bet.  If you think inflation will be higher than this figure you should buy TIPS.  If you think inflation will be lower you buy the normal Treasury instead. Final Thoughts So there you have it this is one tool to potentially hedge a bit against inflation.  Some might also like precious metals energy / commodities or BTC.  One strong advantage of TIPS is its stability and guaranteed nature of at least keeping up with inflation.  Pretty much nothing else can do this and basically the taxpayer foots the bill if inflation goes substantially higher than what regular Treasuries are pricing.  Note also I am not a financial advisor and this is not financial advice.  Perhaps goes without saying but Here are some TIPS for you is not meant to signal a recommendation",
        "New job  have to select 401k with Fidelity Starting a new job and have to pick my 401k investments otherwise it will default to targeted date 2050 plan. Plan is managed via Fidelity. Given the current market trend what will be a good approach plus I have hopefully about 2530 years of employment left so have to plan for the long term. I will actively manage my account. I was thinking of electing 50% contributions to BTC Samp;P 500 and 50% to Dodge amp; Cox Stock Fund Class I occidential 4.2% Charles Schwab Wells Fargo Google Cigna sanofi FedEx Raytheon etc. Also should get foreign stocks  BTC ACWI Ex US IMI: TSMC ASML Nestle Shell etc? And bonds to consider ? US debt at intermediate term ?  Thanks. I am new to stock but want to learn. I lost 20% of my retirement with my previous employer targeted date plan.",
        "Chamath Palihapitiya is reinventing himself as a chastened elder statesman of the tech community In case youre looking for your morning laugh:    Chamath Palihapitiya is reinventing himself as a chastened elder statesman of the tech community Axios Felix Salmon writes. Why it matters: Its an A illustration of how humbling these times are for Silicon Valley. Between the lines: Chamath made his name as a boastful meme lord leading a crowd of retail investor apes into SPACs and crypto. Now hes wearing a dark suit talking about riskadjusted returns and intellectual rigor and remorsefully saying that he was blinded by zero interest rates. I have evolved as a human being Chamath told Axios Dan Primack at the BFD conference in New York yesterday. Ive become a better calmer more focused person. Silicon Valley desperately needs reasonably decent brand ambassadors said Chamath who as recently as last year was tweeting things like Im about to really f$ some shit up. Know thyself: There are professional serious people there that understand how to interface in the rest of the world and I think that that is part of my responsibility now claims Chamath. Flashback: In December 2020 he tweeted that when $BTC gets to $150K I will buy The Hamptons and convert it to sleepaway camps for kids. The big picture: I sort of blame Jay Powell said Chamath for slashing interest rates to zero and allowing him to reap the benefits of a broad speculative fervor. The biggest thing that I learned was how much of my early success was probably not attributable to myself. We have actually had a massive tailwind because we had a zero interest rate environment that allowed us to raise unbelievable amounts of money. What it allowed us to do is crowd into companies. Many of those companies had unbelievable valuations. Eventually these unprofitable businesses went public. Only now are we starting to sort out what are good and what are notsogood businesses. The bottom line: Chamath is painting his excesses as being very much in the past. That dog doesnt hunt when youre 46 he said. via Axios",
        "Could BTC ETFs collapse? Keeping this stock related do you folks think Bitcoin ETFs like BITO could suffer the same fate as exchanges and disappear? Im not quite sure if these ETFs hold their own bitcoin reserves or are investing in it elsewhere. Anybody know how they work and what the dangers are? Thanks.",
        "A little late to this party. Pro shares launches ETF that shorts Bitcoin So Proshares has decided that an ETF that shorts Bitcoin is necessary. They are a little late to this party since BTC has already lost 2/3 of its value. Here is the link:. ",
        "Ive set aside some money. What do you think is a better investment: stocks bitcoin or real estate? Ive been in the game for a long time. I began investing when I was 19 and it has taken me 20 years of investing and saving to invest in a property aside from the one where I live that generates a monthly rental income of $3000. I also invested in Bitcoin about 6 years ago when I bought 20 BTC for about $450 each. I havent sold these yet and I dont plan on doing so anytime soon. I had invested around $9.5k for this at the time which is now worth over $400k and was worth over $1.3M in November of last year which was crazy. Apart from that I have longterm holdings in AAPL TSLA and AMZN and have made a fortune from them having invested more than $20k in each at the time of investment. Ive also invested in other companies and lost a lot of money but I ended up making a lot more than I lost. However I intend to sell my holdings here soon. After selling my stock holdings and using all of the money Ive saved over the years I should have more than $400k after taxes to invest elsewhere.  What in your opinion is a better investment right now? My current strategy is to diversify my funds but Id love to hear your thoughts and opinions on the subject. ps: If crypto/stocks please specify which coin/token/stock and why. Thank you so much",
        "TreasuryDirect Alternatives? Hi all I just created a TreasuryDirect account to put $ in IBonds and they couldnt verify my information likely because I just moved addresses. They are saying I likely wont have account access for 13 freaking weeks. I have a substantial amount of savings that Im trying to put to use in a low risk way and that seemed like my best bet especially before they lower the rates at the end of October. Most of my investments are in broad market funds like VOO or in BTC/ETH and I have a mediumlong term holding horizon. Has anyone had experience getting their account verified promptly? Any suggestions for similar investments that dont require a TreasuryDirect account? TIA UPDATE: Even with Yotta they were unable to make an account for me because they also go through TD.",
        "Is This a Good Portfolio for Long Term? I am not invested in this portfolio yet so I am just asking. %32 cash %32 Samp;P index fund %32 gold %4 BTC . I will rebalance every year. I know it is a lot of cash and gold but I want to be on the safe side. If you think this is a bad portfolio can you explain why.",
        "Binance announces noncontingent purchase of FTX Edit: deal is off The Tweet: gt; This afternoon FTX asked for our help. There is a significant liquidity crunch. To protect users we signed a nonbinding LOI intending to fully acquire  and help cover the liquidity crunch. We will be conducting a full DD in the coming days. I dont follow the space closely but from what I gather  Binance announced a few days ago they were selling FTX backed FTT because of issues at FTX causing a 30% crash of FTT  FTX CEO SBF oh my denied all this just yesterday  However reports of being unable to withdraw from FTX have started recently along with reports that FTX has a negative BTC balance  Binance is the 1 crypto exchange while FTX is 3 creating a mega exchange Coinbase is 2  To further add to the drama if its to be believed Binance worked with the FSB to provide data on Putin foe Alexei Navalny ",
        "The ultimate contrarian investment right now? I am sure the downvotes will pour on but I am intrigued about the Crypto and Blockchain space as this is the ultimate contrarian space right now. If you were in the crypto space at all in 2020 or 2021 ask yourself why? If you no longer have faith in it now that it is selling for a fraction of the price then why not?   I did not chase that bull run but I also dont think that cryptocurrency is entirely a scam that has no place in our financial future. This is a sector that absolutely needed a large portion of the companies in it to get acquired or fold. Most of them were and are running on pure leverage/equity money that was given to them based on the idea that BTC would be 100k and every other investment in the space would follow suit. This is finally happening. Amongst US based publicly audited companies are there any investments that you think will come out on the other side of the current crisis even if BTC never goes above its current price again?    I think the most important is a solid balance sheet that can weather a period of no easy money and real ties to traditional finance which comes with auditing to avoid the shell game that FTX was playing with other companies in their space. Coinbase and Riot are the only two that I am diving into right now. Anyone have any other suggestions?",
        "What do you have your eyes on for 2023 given interest rates inflation etc? Tis the season. With the year coming to an end I think its safe to say 2022 was a bumpy year. Some of you might have just completed your annual review maybe got a promotions/raises/bonus. Given the state of the economy where do you see yourself putting your hard earned money to work?   Below are my 2cents on a few areas Ive been thinking about. Imo the fed will not cut rates over the next year. Even with softening CPI at best the FED will keep rates the same lesson learned from the 70s double top.   Please chime in/share thoughts/rip me apart etc.    Private Ventures:   Entrepreneurs partnerships reselling etc. Private ventures is at the top of my list atm investing in early stage businesses with a high enough margin of safety Housing Market:    Prices have been coming down dramatically in the covid era havens L.A. Atlanta many parts of FL.  At todays 30yr fixed rate1 with 20% down that equates to buying the house 2x over 500k sale = 500k in interest accrued. Investment property makes sense given the circumstances know what a good deal is or get lucky  Im hoping to get super lucky and learn to spot a deal throughout the process. Stocks/Bonds:   Sure 401k contributions and a handful of names. Wasnt planning on exceeding 20% of allocations but things  change. I am interested in hearing your thoughts Savings/CDs:   Id be lying if I said I wasnt heavily invested here. So simple and financially irresponsible to choose a near 0% checking over a high yield savings for idle cash. I like Marcus by Goldman 3.20% as of todays date bonus of 4.2% with their referral program2 gt;Brokered CDs have been 4.60%  4.75% for 912 month CDs. For those wondering what a brokered CD is search for it on Investopedia3 superior to opening a CD at your local bank. Crypto:   I am far from an expert. Ive bought BTC at $99 and well into the $50k range. All things considered this hasnt outperformed any of the aforementioned for me relative to the risk. Ill still dabble but dont expect allocations to be more than 5%.   NOT FINANCIAL ADVICE    1Using 7% for 30 yr fixed assumption. 2Marcus by Goldman has a bonus of 1% over the current rate for the first 3 months if youre referred. 3"
    ],
    "AR": [
        "Snap stock analysis and valuation  The king of storytelling hype and uncertainty $SNAP Snap $SNAP is one of the companies that have a terrible performance as a public company down 50% since its IPO back in March 2017 first trading day closing at $27/share today at around $13. Most of the time as a public company the price fluctuated between $5 and $25. Until the last quarter of 2021. The price started to increase and got to over $80/share in less than a year. Since then the price is down over 80%. This post has two goals:   1. Explain what is Snap how it makes money and what contributed to this crazy share price movement. 2. Provide an analysis of the companys financials and valuation. Lets get started amp;x200B; What is Snap? If you take a look at their annual report the company is being described as a camera company. In my opinion this is misleading as Snap is not manufacturing and selling cameras. They explicitly state that they generate substantially all of the revenue from advertising. My definition is a bit different Snap is a social media company that makes money selling ads. amp;x200B; How does Snap make money? Theres a simple formula that can be applied to every social media company that has the advertising model as a main source of revenue. Revenue =  of users multiplied by ARPU Average revenue per user Having this in mind Snap can grow only by increasing the  of users and/or increasing the ARPU. amp;x200B; The  of users There are two events that I believe are relevant to mention when it comes to this metric: 1. The IPO  If we take a look at the growth of DAU Daily active users on the platform at the point of IPO Snap had a great history and a great story. Storytelling is very important when raising funds. The  of users grew from 50m in Q1/2014 to over 150m in Q1/2017. However after the IPO for the next 3 years up until the end of 2019 they added roughly 50m. Not only did they have slower growth than before but there were quarters when the  of DAU declined. 2. The pandemic  The  of DAU started growing again around this period but the share price didnt start increasing until Q4/2020. Why? The answer is simple. Whenever theres an external event that brings new users theres always doubt that these users will leave the platform once that event is over. However as time went by it was clear that the new Snap members were there to stay and this number kept increasing. So the share price went up and up and up... However growth has limits. Theres a limit to the  of users a platform can bring as well as a limit on the average revenue per user. In 5 markets US UK Australia France Netherlands the company has incredibly high penetration. By this I mean 90% of the 1324yearolds are on the platform and 75% of the 1334 yearolds. I find these numbers sad as I am not a big fan of social media and the impact it has on society but I wont go there as this post is purely intended for Snap as a company. So growing the  of users is difficult in their most valuable markets. Theyll have to wait until more children become teenagers and join the platform. Therefore a large part of the future growth lies in expansion internationally and increasing the ARPU which could be challenging in this environment. The high growth of the last 2 years is again declining and the momentum shifted. The share price declined from $80 to todays $13. As one of the most famous investors Eminem mentioned in his most popular song Lose Yourself  Snap back to reality ope there goes gravity. amp;x200B; Snaps big bet? One of the areas where Snap seems to be ahead is AR Augmented reality not accounts receivable. Over 250m of users engage with AR per day on average. This is definitely huge. If we take into account that the users play with AR lenses over 6b times per day on average well we can easily calculate the average per user. The engagement is quite high.  So what is this actually? One simple example is trying to see how certain shoes look on you. Instead of going to the store Snap has the technology to convert a 2D image to 3D and allow you to see the outcome through the camera. Of course this application is not limited to shoes or clothes but it is a simple example to understand the technology. However they are not alone. Metaverse is one of Facebooks big bets so they are facing competition in this area. amp;x200B; Growing through acquisitions Snap has done numerous acquisitions over the last 7 years. Although this is always a risky strategy as theres no certainty the company will fit well in the existing environment it is very difficult to judge whether these acquisitions are successful or not. The companies that have been acquired are in this industry and are expected to add new features or improve the users experience but it cannot be measured whether they are a good investment or not as they become part of the Snapchat application. amp;x200B; The real decisionmakers Evan Spiegel and Bobby Murphy are the two most important people in this company. Not only because they have high management positions but because they control over 99% of the voting power in the company. No they dont own over 99% of all the shares. Heres why. Snap has 3 types of shares: Class A  publicly traded these are the ones that we can all buy but have 0 voting rights. Class B  not publicly traded have 1 voting right per share Class C  not publicly traded have 10 voting rights per share. You might be wondering well if I buy 1 share or 1000 even if I had voting rights it wouldve made no difference. Why should I be interested in this? Lack of control is being priced at the share price. Imagine a hypothetical scenario where a large institutional investor is deciding between investing in company A and company B both being exactly the same except company Bs shares have no voting power. They would only invest in company Bs shares over company As shares only if they are cheaper. The bigname investors want to have the ability to influence the direction of the company. The discount for lack of control is between 1020%. In my valuation Im using DCF as if the shares have voting rights and Im subtracting 15% of it at the end. amp;x200B; Historical financial performance The companys revenue is growing significantly from $1.2b in 2018 to $4.4b in the last twelve months ending Q1/2022. At the same time gross margin improved from 32% to 60% and all the operating expenses reduced as a % of revenue:  Ramp;D from 65% to 38%  Sales amp; Marketing from 34% to 20%  General amp; Administrative from 40% to 17% Hence the operating margin improved from 107% to 15%. amp;x200B; The balance sheet Snap is not a capitalintensive company the largest expenses are related to its employees and the balance sheet is fairly simple to follow. On the asset side out of the $9b $5b is related to cash and shortterm investment. This has increased significantly from $1.2b at the end of 2018. Where did this cash come from? It came mainly from debt as their longterm loans increased to almost $4b. Having a high cash position is good to reduce the risk of bankruptcy for moneylosing companies. However Snap is not losing money if we exclude the sharebased compensation and there will be pressure to put the $5b in use. It is likely that we see another acquisition coming soon. The level of debt is at an acceptable level especially if we take into account that the interest rate was very low when they increased the debt. In my opinion this was a great decision by the management team. amp;x200B; The valuation I used a DCF model to estimate the companys value. The assumptions are listed below: Revenue growth: 15% for the next 12 months followed by 20% in the 4 years after that and declining over time to 3.41%. Operating margin: To improve over time reach 9% in year 5 and 25% as of year 8. Discount rate: Currently 8.3% increasing to 10.3% over time as the FED is raising the interest rate Discount due to lack of control/voting power: 15% Outcome: $9.11/share Note: In the DCF calculation the outstanding equity options are also taken into account. amp;x200B; What if my assumptions are significantly wrong? Based on the assumptions stated above the revenue will grow by 280% to $16.8b in the next 10 years and the target operating margin is 25%. Lets take a look at how the valuation of the company per share changes based on different assumptions related to the revenue 10 years from now and the operating margin: Revenue / Op. margin20%25%30% :::: 200% $13.3b$5.4$7.3$9.1 280% $16.8b$6.8$9.1$11.4 350% $19.8b$8.0$10.7$13.4 550% $28.6b$11.5$15.3$19.1 Theres a lot of uncertainty ahead of Snap and its success depends on many variables. At the current level it can also be an interesting acquisition target by the larger companies. Id like to get your feedback regarding the post and feel free to share your thoughts.",
        "Can we talk about AAPL and how one of a kind company this is People like to talk about growth companies and future potential of TSLA then jerk off to some nonsense growth numbers of products that doesnt even exists. Here I am sitting with new MacBook pro with M1 Pro chip and Holy lord mighty sweet baby jesus. Apple engineers have schooled all the braindead engineers from Intel AMD Qualcomm fucking name it all who have been in chip industry for not years but MULTIPLE DECADES. From the reviews I knew these chips are good but experience it first time in hand. I am ABSOLUTE mindblown. I have been in software development for over 10 years now worked with different software stack and hardware. But the amount of performance and battery I am seeing with this is just unheard of without even plugged in. Somehow it is almost twice as fast as my last years i7 with almost 3 times the better battery life and fans dont even turn on. I just can not comprehand what kind of sorcery is this. Either they have beat the law of physics or other companies are legit braindead. TLDR Anyways I dont want to turn this into MacBook marketing post. But the point of my post is AAPL is OLD AAPL is still BOLD and APPL is DAD of all. They are still innovating like crazy. This is growth company from all the angles. Dont sleep over it. With all the vertical integration i absolutely can not wait for their AR/VR hardware and even car chips. Just imagine how much tech IP and leverage they have in chip designing now. I dont even think most people are valuing AAPLs silicon in their models. Just in 10 years they went from designing mobile chip to schooling AMD and Intel. What do you guys think? what part of apple excites you?",
        "Meta isnt NFT/Crypto Its VR and Virtual Reality I know the reddit opinion of Meta isnt great but I also think nobody understands it. Its not Crypto and NFTs its a bet on Virtual Reality. If you think Virtual Reality is going away youre just simply wrong.  Everyone is bullish about Apple making $1000 headsets for the first time but suddently bearish when Meta makes BETTER headsets for less than half the cost? Apple making VR Headsets is bullish FOR META because Meta owns all of the gaming infrastructure for the entire platform. You will be using Metas platform just on an Apple headset. Sure Apple can turn it around or attempt to turn it around but theyve already got the largest following all of the infrastructure and a years headstart in the VR/AR space.  Apple has a mobile games store. I have not seen a single person use a VR headset and not be blown away by the technology. You put on the headset and its ready to use. You can use the hand controllers but it also can literally track your hands and you can play VR games just using their machine vision and hand tracking. They have a BETTER VR headset than Apple for half the price and all of the infrastructure and others are trying to take a piece of the pie. They might be able to but I think it either benefits them in the long term or they fail trying to dethrone the Google of VR.  They have over 90% of the market share here and have been perfecting VR/AR since 2014 when oculus was purchased who has been working on the tech since 2012. There isnt any similarities to the Crypto metaverse stuff. Theres no NFTs paid avatars or wahtever. You have an avatar that follows you through games that you play as but its completely free to use and customize and even if you do purchase things for example in game thats not new. Most games have skins to purchase. Its just like Xbox avatars Miis and everything else except in VR. Its a bit more personal because youre playing as that charecter in games like poker certain RPGs etc and you look down and see its your avatar and its more immersive but its not like I am spending $4000 on a monkey picture and theres some open market that hyper monetizes VR.  In fact theres DOZENS of free games and trials and experiences you can play within it. I didnt buy a game for the first several weeks because theres so much free stuff including watching YouTube videos from the inside of the video and some other wild stuff. Its unpopular but: 1. 90% of the people especially here critical of Metas vision of VR have never put on a VR headset 2. He might be an alien but Zuck is spot on with his vision of VR. 3. Facebook without their VR labs is still an incredibly strong underlying business seeing lots of growth and printing money. Once VR takes off thats only going to supplement the growth. Edit: Title  AR amp; Virtual Reality",
        "Looking for small cap stocks with lots of potential to buy during the dip Please dont mention large cap stocks such as Apple nvidia micron Lockheed martin no ets like spy VOO or vti. Just small cap stocks with lists of room for growth. My main areas I wanna look into is a green way of the desalination of salt water into drinkable water space AR/VR and space. Am welcome to suggestions outside of these few markets but would like to hear some of your picks Thank you in advance :",
        "If Zuck decides to stick with his metaverse plan even if 10 years premature can anyone on Metas board pull the funding plug? I used to think that Zuckerberg only has a certain window of time to show that his metaverse push is fruitful and if he fails to do this within that time frame then Metas board will vote his ass out and pull the plug on all the metaverse funding. However the way I understand it is that Mark basically has full controlling power over the company and he could literally ride this metaverse thing into the ground if he wants to and nobody inside Meta nor any of their other majority shareholders can do a damn thing about it. Is this correct?  NOTE: I actually believe that VR/AR will be an unbelievably dominant force in the future of humanity. It really is the next computing platform. Its a runaway train and that train has left the station. Theres no getting that toothpaste back in the bottle. The VR/AR thing will happen but the problem is it could easily be another 15 to 20 years away from legit viability. My biggest concern is that META gets another 7 years into this Metaverse push before pulling the funding plug. Im most concerned with them giving up on this idea six or seven years too early or not having enough cash to power the company through all the years its going to take to see this thing hit the finish line. First Movers Advantage can be a curse if youre there 15 years before society is ready for it OnLive in a great example of a first mover that didnt make it. They were a game streaming company",
        "FAANG  Microsoft are still a genuinely attractive buy to me Long story short Im finding these 6 stocks to be very attractive currently for the following reasons: 1. Generating monstrous free cash flow each with their own future potential growth areas. All of these companies have proven highly innovative with very solid managements especially AAPL AMZN GOOG and MSFT who are sort of in their own little tier. 2. Still have massive user bases pricing power and most of us use their services daily. This is really the crux of the appeal to me. I dont get how people compare these to Pets.com or even Yahoo. From what I see theyre practically inescapable and on avg each person reading this thread probably contributes hundreds of dollars to each of their top lines yearly either directly or indirectly. 3. For the ones that are less gold plated when it comes to the core of their business aka Meta and Netflix they are currently trading at much much saner multiples than before especially Meta and still are solid businesses with moats and tons of FCF. I feel Netflix still offers the best service amongst the streaming platforms and is an innovative enough company to maintain its profitability and growth. It also has streaming as its core bread and butter business unlike AMZN and arguably Disney. Re: Meta Metaverse may look like a weird bet but the VR/AR tech theyre investing in is absolutely industry leading and FB ads still have a massive moat in digital advertising thanks to Insta. Current valuation is a bargain when you consider their profits and growth. Hence I feel theres a decent rational logic to buying these stocks over the next year or so keeping a 10 year  horizon in mind. They might get killed over the next 123 whatever years but I find them to offer solid and reliable value. Thoughts?",
        "If you bought Facebook at IPO and held you would have made only 171% gains While 171% is really impressive its virtually the same as Samp;P500s 179% gain over the same period. The 171% is factoring in the 19% loss after hours today. It seems insane that Facebook couldnt beat Samp;P500 over the same period of time. Its one of the biggest success stories in tech ever. Im actually astonished. Question for you old folks: Are there examples of big companies in the past that tried to pour so much money into growing a new market as Meta has into VR/AR? Were they successful or did they destroy themselves?",
        "META Ramp;D  Tech Workers Opinion For those of you investors who actually work in tech. I dont mean as a nontechnical product manager Im talking SWE IT DevOps AR/VR 3D Printing AI etc.. what are your honest thoughts on the potential of the advancements made in the AR/VR space shown off in Metas latest showcase. Does this make you feel positive about the future or skeptical. Too many Meta bashing posts from people with zero experience developing tech. For reference Im an IT Engineer in Silicon Valley. Hoping for an unbiased educated discussion. Let me know your thoughts",
        "What the Metaverse really is and how it will be a multi trillion dollar industry DISCLAIMER: Im a Meta bull. I do not approve of Zucks management and his tone death attitude but I approve of his vision to an extent he is just awful at projecting and marketing it.  What I think will really take off is social media by AR/VR. Its impossible to tell exactly how as trends change on a dime but my idea is some sort of Vine like social media but from the POV. Mapping the area or scene with LIDAR for your friends and being in the post whether in video or still image. This will not happen with this generation and until AR/VR becomes literally about as clutterless as wearing a pair of Ray Bans. We are currently in the generation of mobile phones the next will be AR/VR. Much like how our parents were in the PC and internet revolution of the 80s and 90s. The next generation will see it as hip. I also think ecommerce with AR/VR is going to blow up especially to see what it is your buying to scale and in front of you. How many times have you purchased something on Amazon and wish you had a scale model of the item to manipulate? The enterprise applications for AR/VR are absolutely endless. AR/VR will change the way we interact with each other namely when LIDAR aided for depth photography is viewable by AR/VR. This already exists its just not mainstream or in consumer hands yet. Imagine getting a VR rendering of your grandma before she passes and having that memory forever. Or youre on deployment in the military and you get a VR video of your family counting down the days until youre home. Designing your brand new house and adding all of your furniture models right there. Or shit a girl on OF selling a VR rendering of herself. All of this is already possible some already being used and an example of the limitless and practical applications of VR/AR tech.  The problem is the Zuck is a goober and is instead promoting the wrong shit. People seem to think the metaverse is the sims/second life when it is NOT. Meta is investing a nuclear amount into the tech to support the digital infrastructure behind all of this. The metaverse is more like another medium to interact with digital technology and information. By definition Runescape and World of Warcraft are both a metaverse but this is how I see the metaverse as we all read about on CNBC come alive. How far away from mainstream total adoption to the scale of mobile phones? Who knows but the tech is making lightning progress. Will Meta come out on top long term? Who knows but they are the ones spearheading this and far ahead of everyone else along with having a massive moat and income to continue funding.  Feel free to shit on me",
        "Advice on current stocks Hello I started investing in stocks a couple of weeks ago and use the Schwab platform. I bought 3 shares of AR 3 shares of AAPL 3 shares of MSFT 2 shares of SRPT 2 shares of EQT and 1 share of DUOL. I use market only and all of them seem to go up and down. The inflation hike is going to just make it worse. What would you do if you were in my shoes?",
        "META  The reports of my death are greatly exaggerated I think its fair to say that social media is at the moment one of the few topics where most of the population can agree to hate on. In this post I would like to deconstruct a few popular myths about Facebook/META and give my personal opinion on how I think the public image of this company has gone from bad to worse in recent history. amp;x200B; Myth 1  META is selling your data to advertisers. I think this is a common misconception that a lot of people make simply because its easy/convenient to understand METAs business model like this. But reality is that META has NEVER sold any of its users data to advertisers in any of the platforms under its umbrella. Instead when advertisers want their ads to be displayed on Facebook/Instagram they request a target audiencethings like age occupation interests political orientation etc. and pay META money. After the contract is signed META will then use its internal algorithms and data to efficiently and accurately target ads requested by the advertiser. No personal data is transferred between META and the advertiser. amp;x200B; One thing to add to this section is about the Cambridge Analytica scandal in 2014. Facebook was not without blame of course but they are not the main culprit. A third party app called  This Is Your Digital Life  improperly harvested data on 87 million Facebook users and then used that data for gaining political advantage in different election races. Facebook is guilty of improperly protecting their users data. Cambridge Analytica was basically doing the stealing while Facebook had a security issue. amp;x200B; Myth 2  No one is using Facebook anymore. Or at least people are leaving METAs platforms in droves. This is simply factually wrong. Global MAUsMonthly Active Users and DAUsDaily Active Users have been increasing every quarter since IPO. It is true that a slight decline started happening in Europe while USA and Canada growth has basically stagnatedbecause already almost anyone is on one of the platforms. But METAs reach is much beyond that. I cannot add images in this subreddit but you can verify this yourself by searching for the MAU/DAU graphs in the last Q3 release. amp;x200B; Myth 3  META is investing all they have into the Metaverse. This is again factually incorrect. Here is a direct quote from the CEO in the last conference call: We continue to direct the majority of our investments toward the development and operation of our Family of Apps. In Q3 Family of Apps expenses were $18.1 billion representing 82% of our overall expenses. Family of Apps expenses grew 18% driven mostly by employeerelated costs infrastructurerelated costs and the impairment of certain operating leases for office facilities that we plan to exit. Our current surge in capex is largely due to building out our AI infrastructure and we would expect capex to come down as a percent of revenue over the long term.  We can clearly see that only 18% of expenses are directed to VR/AR aka the Realty Labs segmentalso the nature of these expenses is that they should come down over time and margins will improve again. The rest of the expenses are going into the traditional apps like Facebook/Instagram/Messenger/Whatsapp. People think that Zuckerberg and his team are lunatics that will throw the whole company in jeopardy because of some dream Zuckerberg had about VR/AR. Dont forget these guys have built a gigantic company with more than 3.6 BILLION users worldwide. They have also bought Instagram and Whatsapppeople were criticizing FB back when these acquisitions were made   and built them out into behemoths as well. amp;x200B; Myth 4  META is dying financially speaking. While it is true that recent earning releases were lackluster people seem to not think about the cyclicality of the advertising business. Given the current economic struggles and the projected global recession incoming do you know how majority of business cut their expenses?  At the top of the list is cutting advertising budgets. Add to this the recent iOS privacy changes and of course META has been struggling to show growthespecially after the increased growth after the pandemic. Zuckerberg has already mentioned that the next leg in revenue growth will not be the Metaverse but monetizing Messenger and Whatsapp:  Beyond Reels messaging is another major monetization opportunity. Billions of people and millions of businesses use WhatsApp and Messenger every day and were confident we can connect them in ways that create valuable experiences. We started with ClicktoMessaging ads which let businesses run ads on Facebook and Instagram that start a thread on Messenger WhatsApp or Instagram Direct so they can communicate with customers directly. This is one of our fastest growing ads products with a $9 billion annual run rate. This revenue is mostly on ClicktoMessenger today since we started there first but ClicktoWhatsApp just passed a $1.5 billion run rate growing more than 80% yearoveryear.  Also the metaverse doesnt have to take over the world in order for it to become a profitable investment.  Reality Labs has been mostly growing since 2020at a loss and only this year has META released the new VR headset . The growth is there it can become profitable in the future and it doesnt mean that all of us will walk around with VR headsets and buy property in the Metaverse. amp;x200B; Concluding thoughts  How did METAs reputation got so bad? Let me begin this by saying that I am in no way absolving META of any blame they made/make mistakes. Their algorithms work in such a way that it brings to the surface some of the most over the top and toxic people/takes. It creates echo chambers that keeps its users engaged/addicted to its apps. At the same time I understand that the benefits that META brings to this planet cannot come without the downsides especially if you want to be using its services for free. Youthe user have to accept the terms and conditions that you will be the product. I am not one to believe in conspiracy theories I like to critically think why/how events unfold. Do you know who is also a player in the ad industry? Traditional media. It is in their direct interest if METAs public image is bad and advertisers pull their money out of META and give it to them. Same can also be said about Applethey dont give a rats ass about your privacy they just want to get a bigger share of the advertising pie themselves . While so many other outlets will be benefiting from METAs demise its easy to understand why a constant flow of bad news/coverage is coming towards META to destroy its reputationworse than any other FAAMG company. Because so many of us are using META and we all can see the glaring issues with its platforms its easy to hop onto a blind hate bandwagon that impairs our financial decision of whether to buy/not buy META stock without looking at the huge investing opportunity META is at its current prices. EDIT: Some people in the comments completely disregard the possibility of this being a great investment decision for the long term. Perhaps META being the most bought stock by superinvestorsgreat investors in the last two quarters will make some to look past their biases. Source: ",
        "Apple is a buy this month Apple is home to some of the worlds most coveted products including the iPhone Air Pods the iPad and its Mac lineup to name a few. The high demand for its tech offerings drove the company to report revenue and operating income growth in its latest quarter despite significant declines in consumer spending throughout the industry. In Q4 2022 the iPhone manufacturer posted revenue of $90.15 billion an 8.1% yearoveryear rise and $1.38 billion more than previous analysts forecasts. Operating income increased 4.6% to $24.89 billion. Moreover Apple has proven its position as one of the best growth stocks out there with its shares rising 249% in the last five years despite a 19% dip in 2022. In fact stock market star Warren Buffett has put 39.2% of Berkshire Hathaways portfolio into Apple stock giving Berkshire a 5.8% stake in the company worth $135.3 billion. In the coming year reports say Apple will enter the $25 billion augmented reality/virtual reality AR/VR market with a new AR/VR headset fill out its Mac lineup with a larger iMac and beefier Mac Mini and further grow its services revenue from recent price hikes. With its longterm plans to venture into even newer areas such as folding phones and electric vehicles Apple will likely continue to see significant gains for years to come. With $111 billion in free cash flow as of Sept. 30 a pricetoearnings ratio of 24 and some exciting developments in 2023 Apple is a screaming buy this December in the runup to the new year.",
        "Wage inflation will be capped by advancements in artificial intellegence? What do you guys think about the theory that a wage/price spiral will be difficult to have due to advancements in AI and robotics in the next economic cycle? If AI and robotics advance to the point where a specialized AI can be designed to compete for most unique human skills businesses will always have an alternative to paying a human more for a specific task. Some examples of how fast this seems to be coming: Text to image artists models photographers etc Text to 3d objects/combined with 3d printing Text to video videographers actors etc Text to video editing video editors etc Darth Vaders voice will be AI generated from now voice actors etc Moderating and sorting social media Etc Robotics lags behind a bit but will eventually allow for real world skills to be to have competition too. Theres also new hardware that AI is enabling like AR/VR headsets",
        "FAANG  MSFT are still a genuinely attractive buy to me Long story short Im finding these 6 stocks to be very attractive currently for the following reasons: 1. Generating monstrous free cash flow each with their own future potential growth areas. All of these companies have proven highly innovative with very solid managements especially AAPL AMZN GOOG and MSFT who are sort of in their own little tier. 2. Still have massive user bases pricing power and most of us use their services daily. This is really the crux of the appeal to me. I dont get how people compare these to Pets.com or even Yahoo. From what I see theyre practically inescapable and on avg each person reading this thread probably contributes hundreds of dollars to each of their top lines yearly either directly or indirectly. 3. For the ones that are less gold plated when it comes to the core of their business aka Meta and Netflix they are currently trading at much much saner multiples than before especially Meta and still are solid businesses with moats and tons of FCF. I feel Netflix still offers the best service amongst the streaming platforms and is an innovative enough company to maintain its profitability and growth. It also has streaming as its core bread and butter business unlike AMZN and arguably Disney. Re: Meta Metaverse may look like a weird bet but the VR/AR tech theyre investing in is absolutely industry leading and FB ads still have a massive moat in digital advertising thanks to Insta. Current valuation is a bargain when you consider their profits and growth. Hence I feel theres a decent rational logic to buying these stocks over the next year or so keeping a 10 year  horizon in mind. They might get killed over the next 123 whatever years but I find them to offer solid and reliable value. Thoughts?",
        "General Discourse about Meta is just not rooted in reality Its a bit disappointing to see so much discourse about Meta that just isnt rooted in reality. Its pretty amazing to me how we can get information so wrong even when its publicly available. Ill just go over some common narratives that just miss the point and then Ill go over the principle of what is going on with Metas stock price. False Narratives 1. Meta stock is declining because people are not using Metas Family of Apps. There are more people using Metas products more than ever. You can read their earnings. Their daily and monthly active users are up. I think there was one quarter in which Meta reported lower DAU/MAU and suddenly theres a narrative that everyone is fleeing their products. This is just not rooted in reality 2. Meta cant compete with TikTok. This narrative I cant really say isnt rooted in reality but from their earnings their Reels views is up 50%. It could be the case that Meta cant compete with TikTok but its unclear to me given the evidence that this the case. At first glance it seems like Reels growth of 50% is pretty good. amp;x200B; There are just a couple off the top of my head that is a bit frustrating because it feels lazy to just circle jerk a narrative without even considering the facts. amp;x200B; The whole point of the stock drop is because Mark and Metas leadership team has decided to invest 10 billion dollars a year in developing the Metaverse. The core business is surprisingly strong. amp;x200B; There are 2 sides to this position that Mark has put Meta in. 1. You believe immersive technology with AR/VR is the future of computing and this investment in the Metaverse creates a technological moat for Meta. 2. You dont believe such immersive technology is possible within the next 510 years and the investment into the Metaverse is a waste. Anyone who tells you with certainty that 1 or 2 is true is presenting you with an opinion. The point is that no one really knows. amp;x200B; The stock price is reflective that more capital has position 2 where they dont believe the investment is worth it. It certainly can be the case that technology has its limits and this kind of technological capability just isnt possible to get good enough where it gets mainstream adoption within the next 510 years. amp;x200B; However it could also be the case that Mark is right. The future is AR/VR and the Metaverse is successful. If certainly can be the case that the technology can get good enough where it gets mainstream adoption. I cant tell you whats going to happen in the future but right now it seems like most people are betting against Meta but that doesnt mean Meta is going to fail. However if people do bet on Mark and Meta and they turn out to be right then they have much bigger upside because the stock price is lowering because it seems like most people do not believe in Metas vision. Im not sure I believe in Metas vision but just because I dont does not automatically mean its destined to fail. The real conversion to have about Meta is whether we believe that such immersive AR/VR technologies can improve to a point where mainstream will adopt it within the next 510 years."
    ],
    "ETC": [
        "What is some important market knowledge more people should know? There are so so so many things to know about the market. The wiki here has a beginner slice of things and even some medium topics. What are more things that you find useful or just that you think people should know? Im talking about market structure bonds and their effect forex close rate payout market participants market makers hedge funds big banks exchanges brokers wealthy actors and special products exotic products whether or not available to retail useful indexes ETFs wrapping useful indexes e.g. sectors useful surveys UM sentiment periodic events FOMC jobs report etc interesting concepts dividends vs special dividends stock splits futures front month vs back month contracts and rolling. ETC ETC. You can just name drop topics if you like. The point is that for all of us there are a lot of unknowns. One cant research things unless they know of the existence of these things. And what are ways you continue to discover new things? Personally Im very interested in useful indexes that exist. I know that Samp;P has a ton but Im sure there are so many others.",
        "Is Commercial Real Estate a Systemic Risk? Hello I would like to discuss the risk of a deleveraging event in the commercial real estate sector.  It seems there are a combination of headwinds that are hitting this market all at once.  Could this be the equivalent of the 2008 housing crisis?  Is residential real estate the potential systemic risk that arises from Fed policy tightening and residual impacts of COVID? Lets just examine some of the risks facing the commercial real estate industry:  Commercial Real Estate tends to be in hightraffic areas meaning it commands a higher price per square foot than residential or other types of real estate  Commercial RE is comprised of several subsectors including Office Retail and Hospitality     These subsectors are somewhat interdependent.  That is hightraffic areas depend on office workers to support restaurants and hotels nearby.  Retail as well to a lesser extent.  Commercial RE tends to be financed in shorter duration than residential.  Commercial RE loans tend to average around 5 years in length.  They will often be structured differently as well one popular format being a balloon structure where the lender pays regular payments for the duration of the loan then a large lump sum for the remainder at maturity.  Interest rates have been increasing rapidly and steeply to combat inflation greatly increasing the cost of financing especially compared to the past 2 years postCOVID.  The workfromhome movement has displaced workers from offices and has resulted in companies moving out of higher cost areas in favor of lower cost areas for ex. from SF to Atlanta  Workfromhome is more prominent and durable in white collar office jobs which tend to be in the most desirable areas downtown major cities Retail  Increasing number of retail transactions done online  Brick amp; mortar retail is in a long term and likely permanent downtrend  Even the consumer staples retailers like Walmart Target just had their worst quarter possibly ever.  Imagine how the less established players are doing.  Now imagine how they will do if we have a long term recession SOURCE:   Its no question we are entering a recessionary environment.  Many companies are entering crisis mode.  Some of the most impacted industries are technology biotech and consumer discretionary.  Raising more capital via equity is now extremely unfavorable for these companies.  Their valuations have been decimated.  Many companies have lost 80% TDOC PTON PYPL DOCU RBLX ETC ETC. Similar decimation in the venture capital markets.  Theres just very little capital being deployed at the moment.  And that is likely to continue for the near future as the Fed continues interest rate hikes and the market continues its riskoff trend.  There is low potential upside in the nearterm because any significant recovery in equities would put pressure on the Fed to tighten further. There was too much excess capital.  It needs to be washed out.  That doesnt happen overnight.  Not from these levels.  There is little reason for excitement in the near term.  The Fed has to ensure inflation stays low and they will require more than a few lower CPI prints to feel satisfied. So with all that said all forms of assets are in a pretty violent repricing at the moment.  Real estate has been more stubborn to drop but it is already coming under pressure.  US residential real estate has less impact.  There is a supply shortage of homes.  There are lots of potential buyers on the sidelines hoping for prices to drop.  Most homeowners refinanced during the Pandemic and locked in low interest rates for 20 years. So even if residential drops it should be relatively uneventful.  The residential market can absorb a correction.  Commercial is a different story.  Real estate is highlyleveraged in general.  No one comes in and buys a property for cash.  Especially in a zero interest rate environment like we had just a year ago.  Theres an estimated $2.6 Trillion in commercial real estate loans outstanding.  Who is going to backstop those loans in a deleveraging event?  The banks?  You think the banks are gonna come in and take those properties?  The banks are in no position to absorb a commercial real estate collapse. This isnt 2008.  There is no easy way out of this.  You can bail out these commercial RE loans but it doesnt fix the underlying problem.  These properties as they exist today are decreasing in utility.  Many will need to be converted into residential / other.  There is simply way too much office space and probably way too much retail as well. In 2008 the housing crisis was just an issue of writing too many mortgages and packaging them as high quality products.  The houses itself werent the problem.  People still needed houses then as much as they did before and as much as they do today.  Technology has not displaced the need for a house.  In fact due to workfromhome it has increased the budget for the average consumers house. Commercial does not have that same intrinsic necessity.  Stores have found a ton of new real estate... online.  Offices have moved... online.  All the businesses that went into supporting the traffic involved in those types of properties are at risk.  So get ready.  This could be the big one that defines this market cycle.  If commercial starts going down the toilet it will be a systemic risk and it will extend all across the market.  IMO it is the first thing that breaks from the Fed continuing to hike rates.",
        "Can 3x ETC generate losses higher than the initial investment ? Simple question I cant find a clear answer. Lets say I put 100$ in a short 3x etc and keep the position open for a long time. Can I incur in margin calls? Or is the risk of loss limited to those 100$ ? For example. I put those 100$ in an short ETC which value is 1  then it goes to 0 the loss should be 3x like 300$ am I right ? But how does it work? Does it get liquidated automatically if the value of the investment goes near 100$ ? Thanks",
        "Intel Analysis  Serious DD This is not a financial advice. gt;Hello Reddit Folks   gt;   gt;It is me again trying to learn fundamentals and stock analysis. Thanks to everyone that replyied and gave me advices last time. I will be quick with introductions.   gt;   gt;Here a link to download the pdf of my thesis on Intel Corporation you will find also the excel on which i did my calculations too.   gt;   gt;Have a nice reading session  Table of Contents 1. Introduction 2. Methodology 3. Main Competitors 4. The Products 5. Fab Locations 6. SWOT Analysis 7. Financial 8. Valuation indicators 9. CEO amp; Management 10. Institutional Ownership 11. Insider Ownership 12. Revenue Forecast 13. Analysts price target 14. Social sentiment 15. Intel vs AMD  Evaluation Comparison 16. Final Considerations Note: some session might not be avaible here on Reddit please feel free to read the complete report here  Introduction  Background Intel used to be a giant in the microchip and semiconductor sector but recently it found itself eclipsed by its competitor in matters of quality strategic development and public perception. Those changes are due to its recent management team which stagnated the company and slowed it with bad management decisions. With the new CEO Pat Gelsinger and his expertise direct experience and knowhow in the sector the company is moving out from its slowdown and trying to catch up with its main rivals.  Purpose The purpose of this thesis is to analyze the development of Intel Corporation INTC during the past four years from 2018 to 2021 and forecast its activity for the next five years. Not only are the financial statements taken into consideration but also macroeconomics factors and its main competitor Advanced Micro Device AMD. All is made to answer the following questions:  What is its position compared to competitors?  Is the company a Buy or a Sell?  Hypothesis  INTC is not a dying company  INTC downtrend is following the sector and the market movement  INTC is a cyclical business and we are in a down cycle  INTC investments will boost its revenues in the next five years  USA government will not allow one of its pivotal and strategic company to fail  INTC will face more stress as AMD is eating market share  INTCs new products are the topnotch of the sector  Methodology When the authors initially wrote this thesis the intention was not to take the position of an expert in company valuation. Instead their aim was to investigate the development of a company based upon information and knowledge obtained from previous education and studies. Moreover the underlying company for this valuation is Intel Corporation since the authors aim to analyse a well reputable company with a strong market brand in a highly competitive market.  Secondary Data Secondary data is the information that doesnt require a direct collection or studies this information is publicly available online for the public to be consulted. Meanwhile primary data are information that has to be collected by direct means such as interviews measurements or polls. In this paper only secondary data and data derived from it are used. Following the main data related to the company that are mainly used for the evaluation models: DataNumber :: Levered Beta0.71 Unlevered Beta0.54 CAPM7.01% WACC6.45% Hurdle Rate11.64% ROE25.50% EPS4.66 P/E5.65 PEG ratio4.43 Corp Tax8.46% Growth Rate Estimate18.26% Analyst growth estimate0.16% Next 5y Analysts growth12.80% Intels Corporate Bonds4.77% Outstanding Shares4106000000 Earnings distributed28.41% Earnings retained71.59%  Macro Economic Data DataNumber :: Market Expected Return9.40% Risk Free Rate4.21% Risk Premium5.19% AAA Bond Yield5.31% Average US GDP Growth3.18% Current Market P/E18.58  Evaluation Methods In this paper five evaluation methods are used to evaluate the companys final fair value. Each method gives us different current fair values for a single share of the company. The final price tag is determined by the average price between all the methods used.  Growth Rate The Growth Rate of 18.26% is calculated taking in count the previous year earnings of 19.86 Billion the retained percentage of the earnings that were not distributed of 71.59% and its historical ROE calculated by the average ROE of the last 4 years of 25.50%.  Free Cash Flow Evaluation Model This simple model takes in mind the company 2021 Free Cash Flow of 30 billion its WACC based discounted rate of 6.45% and its Growth Rate of 18.26% to determine a fair value of $23.57 per share.  Adjusted Graham Fair Value Formula This model is used in the Value Investing communities to price tag a company based on its intrinsic value. This formula is created by Benjamin Graham a value investor and professor at Columbia University who is considered the father of Value Investing. Intrinsic value = EPS  8.5  2  Expected annual growth rate g Which 8.5 is the P/E base of a nogrowth company and the expected growth rate is the company perpetual growth rate for the future. In 1974 in the revised edition of The Intelligent Investor Graham revised the formula to Intrinsic value = EPS  8.5  2g  4.4/Y In this formula 4.4 is the then prevailing 1962 rate on highgrade corporate bonds listed on the New York Stock Exchange. Y is the current yield on AAArated corporate bonds. Graham thought that as the investor had the choice between putting money in common stocks or bonds it was appropriate to take into account the rate of interest paid on a highgrade bond of 4.4 per cent in determining the intrinsic value of a stock. In this thesis we use an adjusted formula Intrinsic value = EPS  7  1g  4.4/Y The P/E of 7 is used because even if a company has zero growth prospects but it is able to maintain cash flows and distribute dividends its P/E is generally higher than 8.5. The used growth rate is the one calculated. The 2 multiplier is too aggressive. Graham never experienced companies with growth rates of 1525 per cent which is common today. Instead of 2 here it is used 1 instead. The interest rate of 4.4 is left as the original some modern adjustment put this value at 8.5 which is the fiveyear fixed deposit rate. This value is the substitute of the riskfree rate which sometimes can be used instead of 4.4. Data used for the calculation: EPS4.66 :: Growth Rate18.26 AAA Bond Yield5.31 The Adjusted Graham Intrinsic Value Formula gives us a price tag of $97.53 amp;x200B;  Discounted Unlevered Free Cash Flow Model A modified version of the traditional Discounted Cash Flow. This model instead of using the free cash flow uses the unlevered one. Unlevered free cash flow UFCF also known as Free cash Flow to the Firm is the amount of available cash a firm has before accounting for its financial obligations. Free cash flow FCF on the other hand is the money a company has left over after paying its operating expenses and capital expenditures. It is used to remove the impact of capital structure on a firms value and to make companies more comparable In simple words. It is the cash flow of a company based on the belief that the company owes no debt therefore has no interest payments to make. In this model it is taken in mind the following data: WACC based discount rate6.45% :: Growth rate18.26% Average US GDP growth rate3.18% rage Shares outstanding4106000000  Dividend Discount Model The dividend discount model DDM is a quantitative method used for predicting the price of a companys stock based on the theory that its presentday price is worth the sum of all of its future dividend payments when discounted back to their present value. The model gives a negative number when companies have a lower rate of return compared to the dividend growth rate. This may happen when a company continues to pay dividends even if it is incurring a loss or relatively lower earnings as per Intel Case. This makes this model not good to be used alone when evaluating a business. Knowing this the model is still used here mainly because the final price tag is determined by the average of all the methods. This choice is made by the necessity of conservative estimates and cautious predictions. The discounted rating used here is the CAPM of 7.01%. The model gives the following result: Fair Value taking in count a perpetual growth rate. Here we used the company growth rate of 18.26% and not the average growth rate of the dividends. This is due to the fact that the price given by the dividend growth is considered to be unrealistic for the next five years.$15.36 :: Fair Value assuming a zero growth in the dividends growth. This price is not used to determine the final value due to the fact that the company has historically paid dividends with constant growth and it is predicted to not stop this trend.$24.62 amp;x200B;  Total Payout Model It is a variation of the DDF that takes in count shares repurchases. With 5.64 Billion paid in dividend in 2021 discount rate of 7.01% CAPM and growth rate of 18.26% this model gives us a price tag of $12.22  Final Fair Value The Final price tag is determined as per following: Free Cash Flow Evaluation Model$23.57 :: Adjusted Graham Fair Value Formula$97.53 Discounted Unleveread Free Cash Flow Model$56.67 Dividend Discount Model$15.36 Total Payout Model$12.22 Final Fair Price Average$30.04 amp;x200B;  Main Competitors Intel Corporation is in the Semiconductors sector. As the only leadingedge U.S. semiconductor company that both develops and manufactures its own technology Intel has a widespread economic impact in every sector of the U.S. economy and a strategic advantage over its competitors. It is also the largest publicly traded semiconductor chipmaker in the United States. The company is responsible for creating the x86 microprocessor which is a part of nearly all personal computers today. Despite being a leader in its market Intel operates in an area that has many players that compete for market share. Below are some of Intels main competitors. AMD  Advanced Micro Devices like Intel produces more than just microprocessors. Both companies create motherboards servers and other computerrelated hardware. In terms of the x86 microprocessor AMD is Intels biggest competitor. Intel and AMD are rivals much like Apple and Microsoft. They have certain specifications and dedicated users that will always stick to one over the other. Products from both companies are similar in price and quality. Though Intels chips are primarily found in the computers of large companies the competition between Intel and AMD comes down to individuals that build their own computers. : IBM  International Business Machines is one of the first computer companies in the world Founded in 1911 it was the pioneer in computer technology during the 20th century. The company developed the ATM the hard disk the floppy disk the magnetic stripe and many more. It is one of the 30 companies on the Dow Jones Industrial Average DJIA and one of the largest employers in the world. IBM used to produce computers using Intels processors but has since sold off that business and is now selling its own servers and mainframes using its own processors putting itself directly in competition with Intel. The company launched a program to open source much of its architecture and firmware back in 2013 which attracted many new customers to using its Central Processing Units stealing market share from Intel. NVIDIA  NVIDIA is one of the key players in the graphics processing unit GPU market. It is one of the biggest names in video games. It also designs chips for mobile phones and automobiles. Many of its chips are used in supercomputers and it is now working on artificial intelligence. Intel released a new graphics card in the second half of 2021 that is competing directly with Nvidias dominance in that field. It is used to compete in areas of data centre artificial intelligence and machine learning. Samsung  In 2018 it surpassed Intel as the largest semiconductor maker by revenue but in 2019 Intel took that spot back. Its clear that both companies strive against one another for the top spot. Intel and Samsung dont compete in all fields however. Intels products primarily focus on desktops and laptops whereas Samsung focuses on semiconductors for smartphones and data centres.  The Products CGC  Client Computing Group includes products designed for enduser form factors focusing on higher growth segments of 2in1 thin andlight commercial and gaming and growing other products such as connectivity and graphics : NEX  Network and Edge Group includes programmable platforms and highperformance connectivity and compute solutions designed for market segments such as cloud networking communications networks retail industrial healthcare and vision. DCAI  Datacenter and AI Group includes a broad portfolio of CPUs domain specific accelerators FPGAs and memory designed to empower datacenter and hyperscale solutions for diverse computing needs AXG  Accelerated Computing System Graphics Group includes CPUs for high performance computing HPC and GPUs targeted for a range of workloads and platforms from gaming and content creation to HPC and AI in the data centre IFS  Intel Foundry Services is a services provider offering a combination of leadingedge packaging and process technology worldclass differentiated internal IPs i.e.: x86 graphics AI broad 3rd party ecosystem and silicon design support. Mobileye includes the development and deployment of advanced driver assistance systems ADAS and autonomous driving technologies and solutions.  SWOT Analysis  Strengths  Strong Industry position: it has a strong market share in its major business segment. The main product is not easily copied.  Economies of scale: the microprocessor market i very large and Intel has a strong manufacturing plants  Strong Research: Intels research team is highly professional and made some breakthrough tech that cannot be copied by other manufacturers  Strong partnership with Microsoft: this partnership limits the market share growth of competitors  Trustworthy raw material suppliers: it has a solid base of reliable raw material suppliers  Strong HighTech culture: its products are cutting edge innovations not easy to copy  High Level of customer satisfaction: It has a dedicated customer relation department that allows it to have a high level of customer satisfaction and brand recognition  Strong Distribution Network: It has developed a dependable distribution network that can reach the majority of its potential market  High Free Cash Flow: It has strong Free Cash Flow which allows it to grow into new initiative and reinvest in the company  Brand Recognition: It has a strong brand recognition positive perception of its products  Social Media: Intel invests in Social Media channel to reach its customers  Weaknesses  High costs of goods: It has high fixed costs which adversary affects profit margins  High level of debt: It has a lot of debt which increases the interest costs on funds borrowed to finance activities.  Declining PC sales: the PC market is shrinking due to post Covid open up and cycle of the business  High Dependency on the Main Segment: Intel has a strong dependency on PC sales  Limited Business Diversification: Intel is facing challenges in diversifying. It is trying to enter the mobile phone tablet and TV segments.  Limited Customer Care in Developing Countries: the companys customer care is less active in developing countries missing new potential customers  Weak Ramp;D: the company research and development division as a small investment compared to its revenue  Opportunities  High Growth: its products are expected to be in high demand in the next growth cycle  Increase in Demand: expected increase in demands for personal computers and servers  Automatic Cars: this market requires hightech processors  Drones: their usage is growing year after year and is a great opportunity for Intel  Developing Countries: are expected to grow and are an opportunity to acquire new customers and partners  Defence sector: institutional contractors might demand Intel hightech processors for strategic tech and services  Treats  Competition: Intel is a leading leader in its industry and is facing high pressure from competitors such as: AMD NVIDIA Qualcomm Samsung  Competitors New product launches:Competitors products are threatening Intel leadership  Price sensitivity: semiconductor market is a highly price sensitive market and cheaper products from competitors might drastically eat away Intels market share  Fluctuating PC sales: Intel is too dependent on this segment  Harmful regulations: the company is facing harmful regulations from countries that are trying to erode the sale of Intels products  Geopolitical Events: Semiconductors is a strategic industry for many countries and international political events might impact the company  Reliance on third party manufacturers: Intel and Manufacturers are highly dependent from each others  Financials  Income Statement In the past three years the average increase in revenue has gone up by 0.10% showing a stagnation of sales with the growth from 2020 to 2021 being 0.47%. While having an average increase in operating expense of 2.14% with the last year increase from 2020 to 2021 of 10.12% showing a spike in costs for the last operating period. It is expected for the year 2022 to have both Costs and Revenue increase by approximately 18% A point of some concern might be the small decrease in net revenue in those past 4 years confirming a stagnation of the business.  Balance Sheet The 2021 balance sheet shows us  Short term debt of 4.59 Billion coverable by cash and cash equivalents plus account receivables but not only by Camp;C alone  Long term debt is coverable by current assets alone  Increased stockholders equity earnings are being retained in the company and reinvested  Cash Flows Intel has positive Cash Flow from Operations in the last four years. Same thing for Net Cash Flow. A reduction of both can be observed for the last year. The Company has an Income Quality ratio of 1.51 which is good and signals a healthy income. INTC is investing heavily in PPamp;E amp;x200B; TO SEE RATIOS ETC LOOK AT THE PDF HERE  Revenue Forecast With the release of the new Intel Arc 7 with has the potential and capability to rival and surpass its competitors NVIDIA and AMD and a increase in demand for the year 2023 it is forecasted a growth in revenue according to the growth rate calculated of 18.26%  Analysts Price Target $52 High $34 Average $18 Low $30 Authors TO SEE OTHER PARTS CHECK OUT THE PDF REPORT HERE I CAN UPLOAD PICS THAT IS WHY IT IS BETTER TO READ IT FROM THE MAIN PAPER  Final Considerations  What is its position compared to competitors? By observing the industry and taking in count different factors such as geopolitical and market demands for electronics we can forecast a possible development for Intel. INTC has a strong customer base and it is known worldwide for its contributions and development of cutting hedge technologies this is well resonated especially in developing countries such as India China Nigeria and Indonesia. While its North American market share in Graphics and Motherboards got eroded by some percentage by its main competitor AMD it still maintain a leadership position in the sector. We shall note that Intel operates in sectors which permit it to diversify a little bit its products portfolio where AMD doesnt have expertise nor is capable to compete. With high inflation and interest rate corroding the whole market it is expected to meet some possible downturn for the near period of time 3 to 6 months and stabilise within a year while the FED is fighting the raising of costs. The company has strong fundamentals that shields it from possible adverse events in the near future and its cash flow quality is high. Intel Corporation is currently undervalued due to North American Market downtrend perception of it due to the rivals marketing attacks. It is also reasonable that the past CEO brought the company into stagnation and slowdown but with the new one with his expertise and experience we can expect a turnaround and regain of some market share in the next few years. With US Government subsidies for the semiconductor industry we can see a deep strategic interest in bringing and boosting domestic productions and reducing potential risk from over relying on taiwanese manufacturers. This incentivised Intel to invest in two new fabs one in Ohio and one in Arizona plans to expand existing plants are already funded and another European production site is planned in Germany. SWOT analysis shows us many strong moats for the business which are its competitive advantages over competitors. Huge potentials can be exploited if the company decided to pursue an expansion strategy into developing countries and markets. Lack of insiders sell which the last one in february 2022 shows us that the management is confident in the companys future development which is confirmed by additional buying from the CEO itself in the last months. Big Institutions and Mutual Funds hold portions of the company too signalling strong sentimento towards the company. Employees rating and satisfaction rate is high salaries arent that much different from rivals.  Is the company a Buy or a Sell? The company is distributing regular dividends it has strong fundamentals and lots of cash to meet adverse events. Institutions and insiders are holding. The current downtrend is due to market trend and social mechanism of which contributed AMD marketing in damaging Intels perception in the CPU segment. Fundamentally though the company has many potentials and growth opportunities especially now with its new release Intel Arc 7. Intel is a smart investment for long term holders not only because its intrinsic value is expected to grow but also for the fact that it pays high dividends yield. If the company was in a severe situation it still can retain earnings to cover expenses even if it is unlikely due to its present liquidity. In the end the verdict is one: Buy. Fair Value is $30. What are you thoughts? Is Intel a Buy or a Sell? Let us all know amp;x200B; amp;x200B; amp;x200B; This is not a financial advice.",
        "Intel Corporation Evaluation  Comparison with previous Analysis  $30 Fair Value Today Intel had an earning release. So i did this Analysis Two days ago about Intel. As predicted Its fair value with the current situation is $30 per share. Here the previous post from two days ago. I will adjust those data in the next week and give you a fixed evaluation for the next Quarter. Intels earning documents and filling: Intel Web Site If you havent yet ejoy the reading  This is not a financial advice. gt;Hello Reddit Folks   gt;   gt;It is me again trying to learn fundamentals and stock analysis. Thanks to everyone that replyied and gave me advices last time. I will be quick with introductions.   gt;   gt;Here a link to download the pdf of my thesis on Intel Corporation you will find also the excel on which i did my calculations too.   gt;   gt;Have a nice reading session  Table of Contents 1. Introduction 2. Methodology 3. Main Competitors 4. The Products 5. Fab Locations 6. SWOT Analysis 7. Financial 8. Valuation indicators 9. CEO amp; Management 10. Institutional Ownership 11. Insider Ownership 12. Revenue Forecast 13. Analysts price target 14. Social sentiment 15. Intel vs AMD  Evaluation Comparison 16. Final Considerations Note: some session might not be avaible here on Reddit please feel free to read the complete report here  Introduction  Background Intel used to be a giant in the microchip and semiconductor sector but recently it found itself eclipsed by its competitor in matters of quality strategic development and public perception. Those changes are due to its recent management team which stagnated the company and slowed it with bad management decisions. With the new CEO Pat Gelsinger and his expertise direct experience and knowhow in the sector the company is moving out from its slowdown and trying to catch up with its main rivals.  Purpose The purpose of this thesis is to analyze the development of Intel Corporation INTC during the past four years from 2018 to 2021 and forecast its activity for the next five years. Not only are the financial statements taken into consideration but also macroeconomics factors and its main competitor Advanced Micro Device AMD. All is made to answer the following questions:  What is its position compared to competitors?  Is the company a Buy or a Sell?  Hypothesis  INTC is not a dying company  INTC downtrend is following the sector and the market movement  INTC is a cyclical business and we are in a down cycle  INTC investments will boost its revenues in the next five years  USA government will not allow one of its pivotal and strategic company to fail  INTC will face more stress as AMD is eating market share  INTCs new products are the topnotch of the sector  Methodology When the authors initially wrote this thesis the intention was not to take the position of an expert in company valuation. Instead their aim was to investigate the development of a company based upon information and knowledge obtained from previous education and studies. Moreover the underlying company for this valuation is Intel Corporation since the authors aim to analyse a well reputable company with a strong market brand in a highly competitive market.  Secondary Data Secondary data is the information that doesnt require a direct collection or studies this information is publicly available online for the public to be consulted. Meanwhile primary data are information that has to be collected by direct means such as interviews measurements or polls. In this paper only secondary data and data derived from it are used. Following the main data related to the company that are mainly used for the evaluation models: DataNumber :: Levered Beta0.71 Unlevered Beta0.54 CAPM7.01% WACC6.45% Hurdle Rate11.64% ROE25.50% EPS4.66 P/E5.65 PEG ratio4.43 Corp Tax8.46% Growth Rate Estimate18.26% Analyst growth estimate0.16% Next 5y Analysts growth12.80% Intels Corporate Bonds4.77% Outstanding Shares4106000000 Earnings distributed28.41% Earnings retained71.59%  Macro Economic Data DataNumber :: Market Expected Return9.40% Risk Free Rate4.21% Risk Premium5.19% AAA Bond Yield5.31% Average US GDP Growth3.18% Current Market P/E18.58  Evaluation Methods In this paper five evaluation methods are used to evaluate the companys final fair value. Each method gives us different current fair values for a single share of the company. The final price tag is determined by the average price between all the methods used.  Growth Rate The Growth Rate of 18.26% is calculated taking in count the previous year earnings of 19.86 Billion the retained percentage of the earnings that were not distributed of 71.59% and its historical ROE calculated by the average ROE of the last 4 years of 25.50%.  Free Cash Flow Evaluation Model This simple model takes in mind the company 2021 Free Cash Flow of 30 billion its WACC based discounted rate of 6.45% and its Growth Rate of 18.26% to determine a fair value of $23.57 per share.  Adjusted Graham Fair Value Formula This model is used in the Value Investing communities to price tag a company based on its intrinsic value. This formula is created by Benjamin Graham a value investor and professor at Columbia University who is considered the father of Value Investing. Intrinsic value = EPS  8.5  2  Expected annual growth rate g Which 8.5 is the P/E base of a nogrowth company and the expected growth rate is the company perpetual growth rate for the future. In 1974 in the revised edition of The Intelligent Investor Graham revised the formula to Intrinsic value = EPS  8.5  2g  4.4/Y In this formula 4.4 is the then prevailing 1962 rate on highgrade corporate bonds listed on the New York Stock Exchange. Y is the current yield on AAArated corporate bonds. Graham thought that as the investor had the choice between putting money in common stocks or bonds it was appropriate to take into account the rate of interest paid on a highgrade bond of 4.4 per cent in determining the intrinsic value of a stock. In this thesis we use an adjusted formula Intrinsic value = EPS  7  1g  4.4/Y The P/E of 7 is used because even if a company has zero growth prospects but it is able to maintain cash flows and distribute dividends its P/E is generally higher than 8.5. The used growth rate is the one calculated. The 2 multiplier is too aggressive. Graham never experienced companies with growth rates of 1525 per cent which is common today. Instead of 2 here it is used 1 instead. The interest rate of 4.4 is left as the original some modern adjustment put this value at 8.5 which is the fiveyear fixed deposit rate. This value is the substitute of the riskfree rate which sometimes can be used instead of 4.4. Data used for the calculation: EPS4.66 :: Growth Rate18.26 AAA Bond Yield5.31 The Adjusted Graham Intrinsic Value Formula gives us a price tag of $97.53 amp;x200B;  Discounted Unlevered Free Cash Flow Model A modified version of the traditional Discounted Cash Flow. This model instead of using the free cash flow uses the unlevered one. Unlevered free cash flow UFCF also known as Free cash Flow to the Firm is the amount of available cash a firm has before accounting for its financial obligations. Free cash flow FCF on the other hand is the money a company has left over after paying its operating expenses and capital expenditures. It is used to remove the impact of capital structure on a firms value and to make companies more comparable In simple words. It is the cash flow of a company based on the belief that the company owes no debt therefore has no interest payments to make. In this model it is taken in mind the following data: WACC based discount rate6.45% :: Growth rate18.26% Average US GDP growth rate3.18% rage Shares outstanding4106000000  Dividend Discount Model The dividend discount model DDM is a quantitative method used for predicting the price of a companys stock based on the theory that its presentday price is worth the sum of all of its future dividend payments when discounted back to their present value. The model gives a negative number when companies have a lower rate of return compared to the dividend growth rate. This may happen when a company continues to pay dividends even if it is incurring a loss or relatively lower earnings as per Intel Case. This makes this model not good to be used alone when evaluating a business. Knowing this the model is still used here mainly because the final price tag is determined by the average of all the methods. This choice is made by the necessity of conservative estimates and cautious predictions. The discounted rating used here is the CAPM of 7.01%. The model gives the following result: Fair Value taking in count a perpetual growth rate. Here we used the company growth rate of 18.26% and not the average growth rate of the dividends. This is due to the fact that the price given by the dividend growth is considered to be unrealistic for the next five years.$15.36 :: Fair Value assuming a zero growth in the dividends growth. This price is not used to determine the final value due to the fact that the company has historically paid dividends with constant growth and it is predicted to not stop this trend.$24.62 amp;x200B;  Total Payout Model It is a variation of the DDF that takes in count shares repurchases. With 5.64 Billion paid in dividend in 2021 discount rate of 7.01% CAPM and growth rate of 18.26% this model gives us a price tag of $12.22  Final Fair Value The Final price tag is determined as per following: Free Cash Flow Evaluation Model$23.57 :: Adjusted Graham Fair Value Formula$97.53 Discounted Unleveread Free Cash Flow Model$56.67 Dividend Discount Model$15.36 Total Payout Model$12.22 Final Fair Price Average$30.04 amp;x200B;  Main Competitors Intel Corporation is in the Semiconductors sector. As the only leadingedge U.S. semiconductor company that both develops and manufactures its own technology Intel has a widespread economic impact in every sector of the U.S. economy and a strategic advantage over its competitors. It is also the largest publicly traded semiconductor chipmaker in the United States. The company is responsible for creating the x86 microprocessor which is a part of nearly all personal computers today. Despite being a leader in its market Intel operates in an area that has many players that compete for market share. Below are some of Intels main competitors. AMD  Advanced Micro Devices like Intel produces more than just microprocessors. Both companies create motherboards servers and other computerrelated hardware. In terms of the x86 microprocessor AMD is Intels biggest competitor. Intel and AMD are rivals much like Apple and Microsoft. They have certain specifications and dedicated users that will always stick to one over the other. Products from both companies are similar in price and quality. Though Intels chips are primarily found in the computers of large companies the competition between Intel and AMD comes down to individuals that build their own computers. : IBM  International Business Machines is one of the first computer companies in the world Founded in 1911 it was the pioneer in computer technology during the 20th century. The company developed the ATM the hard disk the floppy disk the magnetic stripe and many more. It is one of the 30 companies on the Dow Jones Industrial Average DJIA and one of the largest employers in the world. IBM used to produce computers using Intels processors but has since sold off that business and is now selling its own servers and mainframes using its own processors putting itself directly in competition with Intel. The company launched a program to open source much of its architecture and firmware back in 2013 which attracted many new customers to using its Central Processing Units stealing market share from Intel. NVIDIA  NVIDIA is one of the key players in the graphics processing unit GPU market. It is one of the biggest names in video games. It also designs chips for mobile phones and automobiles. Many of its chips are used in supercomputers and it is now working on artificial intelligence. Intel released a new graphics card in the second half of 2021 that is competing directly with Nvidias dominance in that field. It is used to compete in areas of data centre artificial intelligence and machine learning. Samsung  In 2018 it surpassed Intel as the largest semiconductor maker by revenue but in 2019 Intel took that spot back. Its clear that both companies strive against one another for the top spot. Intel and Samsung dont compete in all fields however. Intels products primarily focus on desktops and laptops whereas Samsung focuses on semiconductors for smartphones and data centres.  The Products CGC  Client Computing Group includes products designed for enduser form factors focusing on higher growth segments of 2in1 thin andlight commercial and gaming and growing other products such as connectivity and graphics : NEX  Network and Edge Group includes programmable platforms and highperformance connectivity and compute solutions designed for market segments such as cloud networking communications networks retail industrial healthcare and vision. DCAI  Datacenter and AI Group includes a broad portfolio of CPUs domain specific accelerators FPGAs and memory designed to empower datacenter and hyperscale solutions for diverse computing needs AXG  Accelerated Computing System Graphics Group includes CPUs for high performance computing HPC and GPUs targeted for a range of workloads and platforms from gaming and content creation to HPC and AI in the data centre IFS  Intel Foundry Services is a services provider offering a combination of leadingedge packaging and process technology worldclass differentiated internal IPs i.e.: x86 graphics AI broad 3rd party ecosystem and silicon design support. Mobileye includes the development and deployment of advanced driver assistance systems ADAS and autonomous driving technologies and solutions.  SWOT Analysis  Strengths  Strong Industry position: it has a strong market share in its major business segment. The main product is not easily copied.  Economies of scale: the microprocessor market i very large and Intel has a strong manufacturing plants  Strong Research: Intels research team is highly professional and made some breakthrough tech that cannot be copied by other manufacturers  Strong partnership with Microsoft: this partnership limits the market share growth of competitors  Trustworthy raw material suppliers: it has a solid base of reliable raw material suppliers  Strong HighTech culture: its products are cutting edge innovations not easy to copy  High Level of customer satisfaction: It has a dedicated customer relation department that allows it to have a high level of customer satisfaction and brand recognition  Strong Distribution Network: It has developed a dependable distribution network that can reach the majority of its potential market  High Free Cash Flow: It has strong Free Cash Flow which allows it to grow into new initiative and reinvest in the company  Brand Recognition: It has a strong brand recognition positive perception of its products  Social Media: Intel invests in Social Media channel to reach its customers  Weaknesses  High costs of goods: It has high fixed costs which adversary affects profit margins  High level of debt: It has a lot of debt which increases the interest costs on funds borrowed to finance activities.  Declining PC sales: the PC market is shrinking due to post Covid open up and cycle of the business  High Dependency on the Main Segment: Intel has a strong dependency on PC sales  Limited Business Diversification: Intel is facing challenges in diversifying. It is trying to enter the mobile phone tablet and TV segments.  Limited Customer Care in Developing Countries: the companys customer care is less active in developing countries missing new potential customers  Weak Ramp;D: the company research and development division as a small investment compared to its revenue  Opportunities  High Growth: its products are expected to be in high demand in the next growth cycle  Increase in Demand: expected increase in demands for personal computers and servers  Automatic Cars: this market requires hightech processors  Drones: their usage is growing year after year and is a great opportunity for Intel  Developing Countries: are expected to grow and are an opportunity to acquire new customers and partners  Defence sector: institutional contractors might demand Intel hightech processors for strategic tech and services  Treats  Competition: Intel is a leading leader in its industry and is facing high pressure from competitors such as: AMD NVIDIA Qualcomm Samsung  Competitors New product launches:Competitors products are threatening Intel leadership  Price sensitivity: semiconductor market is a highly price sensitive market and cheaper products from competitors might drastically eat away Intels market share  Fluctuating PC sales: Intel is too dependent on this segment  Harmful regulations: the company is facing harmful regulations from countries that are trying to erode the sale of Intels products  Geopolitical Events: Semiconductors is a strategic industry for many countries and international political events might impact the company  Reliance on third party manufacturers: Intel and Manufacturers are highly dependent from each others  Financials  Income Statement In the past three years the average increase in revenue has gone up by 0.10% showing a stagnation of sales with the growth from 2020 to 2021 being 0.47%. While having an average increase in operating expense of 2.14% with the last year increase from 2020 to 2021 of 10.12% showing a spike in costs for the last operating period. It is expected for the year 2022 to have both Costs and Revenue increase by approximately 18% A point of some concern might be the small decrease in net revenue in those past 4 years confirming a stagnation of the business.  Balance Sheet The 2021 balance sheet shows us  Short term debt of 4.59 Billion coverable by cash and cash equivalents plus account receivables but not only by Camp;C alone  Long term debt is coverable by current assets alone  Increased stockholders equity earnings are being retained in the company and reinvested  Cash Flows Intel has positive Cash Flow from Operations in the last four years. Same thing for Net Cash Flow. A reduction of both can be observed for the last year. The Company has an Income Quality ratio of 1.51 which is good and signals a healthy income. INTC is investing heavily in PPamp;E amp;x200B; TO SEE RATIOS ETC LOOK AT THE PDF HERE  Revenue Forecast With the release of the new Intel Arc 7 with has the potential and capability to rival and surpass its competitors NVIDIA and AMD and a increase in demand for the year 2023 it is forecasted a growth in revenue according to the growth rate calculated of 18.26%  Analysts Price Target $52 High $34 Average $18 Low $30 Authors TO SEE OTHER PARTS CHECK OUT THE PDF REPORT HERE I CAN UPLOAD PICS THAT IS WHY IT IS BETTER TO READ IT FROM THE MAIN PAPER  Final Considerations  What is its position compared to competitors? By observing the industry and taking in count different factors such as geopolitical and market demands for electronics we can forecast a possible development for Intel. INTC has a strong customer base and it is known worldwide for its contributions and development of cutting hedge technologies this is well resonated especially in developing countries such as India China Nigeria and Indonesia. While its North American market share in Graphics and Motherboards got eroded by some percentage by its main competitor AMD it still maintain a leadership position in the sector. We shall note that Intel operates in sectors which permit it to diversify a little bit its products portfolio where AMD doesnt have expertise nor is capable to compete. With high inflation and interest rate corroding the whole market it is expected to meet some possible downturn for the near period of time 3 to 6 months and stabilise within a year while the FED is fighting the raising of costs. The company has strong fundamentals that shields it from possible adverse events in the near future and its cash flow quality is high. Intel Corporation is currently undervalued due to North American Market downtrend perception of it due to the rivals marketing attacks. It is also reasonable that the past CEO brought the company into stagnation and slowdown but with the new one with his expertise and experience we can expect a turnaround and regain of some market share in the next few years. With US Government subsidies for the semiconductor industry we can see a deep strategic interest in bringing and boosting domestic productions and reducing potential risk from over relying on taiwanese manufacturers. This incentivised Intel to invest in two new fabs one in Ohio and one in Arizona plans to expand existing plants are already funded and another European production site is planned in Germany. SWOT analysis shows us many strong moats for the business which are its competitive advantages over competitors. Huge potentials can be exploited if the company decided to pursue an expansion strategy into developing countries and markets. Lack of insiders sell which the last one in february 2022 shows us that the management is confident in the companys future development which is confirmed by additional buying from the CEO itself in the last months. Big Institutions and Mutual Funds hold portions of the company too signalling strong sentimento towards the company. Employees rating and satisfaction rate is high salaries arent that much different from rivals.  Is the company a Buy or a Sell? The company is distributing regular dividends it has strong fundamentals and lots of cash to meet adverse events. Institutions and insiders are holding. The current downtrend is due to market trend and social mechanism of which contributed AMD marketing in damaging Intels perception in the CPU segment. Fundamentally though the company has many potentials and growth opportunities especially now with its new release Intel Arc 7. Intel is a smart investment for long term holders not only because its intrinsic value is expected to grow but also for the fact that it pays high dividends yield. If the company was in a severe situation it still can retain earnings to cover expenses even if it is unlikely due to its present liquidity. In the end the verdict is one: Buy. Fair Value is $30. What are you thoughts? Is Intel a Buy or a Sell? Let us all know amp;x200B; amp;x200B; amp;x200B; This is not a financial advice."
    ],
    "AXS": [
        "Dont Like Jim Cramers Stock Calls? This ETF Bets Against Mad Money Host. Late Wednesday Matthew Tuttle of Tuttle Capital Management filed a prospectus with the Securities and Exchange Commission for an exchangetraded fund that will bet against the stock recommendations made by Jim Cramer host of the CNBC show Mad Money. The idea of a fund that would do the opposite of what Cramer suggests has been a running joke on social platforms like Reddit where users have periodically ridiculed him for his market views. But the idea is nothing new. Datajournalism articles in Barrons in 2007 and 2009 found that his picks trailed behind the market. A Reddit group and at least 10 Twitter handles now keep track of Cramers calls. Several indexes have been set up in the past year or so to highlight how an investor would do by betting against his recommendations though none is linked to an investment vehicle. I couldnt resist Tuttle said in a response to a Wednesday tweet by Barrons reporter Tae Kim noting the filing. He also filed paperwork for a fund the Long Cramer ETF ticker: LJIM that will invest in stocks on which Cramer is positive. Cramer didnt immediately respond to a request for comment. Tuttles Inverse Cramer ETF SJIM will invest at least 80% of its holdings to achieve the opposite result from what an investor would get by holding the stocks Cramer suggests. It will either sell those stocks short or enter into derivatives transactions such as swaps that produce a negative correlation the filing said. Investors may not be surprised that Tuttle is the one bringing the Inverse Cramer ETF to market. This year the fund manager launched the AXS Short Innovation Daily ETF SARK which wins when investor Cathie Woods ARK Innovation ETF ARKK loses. Tuttles fund which readjusts its holdings every day has risen 104% this year as Woods fund has slid as a result of bets on companies such as Zoom Video Communications  ZM  and Roku  ROKU  When that fund was launched Woods called it ridiculous and obsessed with the short term in an interview with CNBC. An Inverse Cramer index in circulation on Twitter is up 16% so far this year. Of course with the Samp;P 500 down sharply this year a fund betting against the broader market would also be doing well. Both the Long Cramer and Inverse Cramer funds will contain 20 to 25 stocks. Tuttle told Barrons the fees and expenses for the funds havent been made public. His AXS Short Innovation Daily has an expense ratio of 0.75%. That means that costs such as administration and marketing amount to $7.50 a year for every $1000 in the fund. Investors can start buying the Cramer ETFs in late December. Reddit users are upbeat about the Inverse Cramer fund. I know what Ill be buying myself for chistmas Thnx one said. At least three others said they plan to funnel most if not all of their 401ks into the ETF. I am going all in one said.",
        "What to trade in a recession Recently wrote a mutual fund screener in Python to decide what performs best. Subsets:  Download information and historic pricing information from Yahoo Finance  Calculate returns and risk ratios for each mutual fund  Sort the results by returns risk ratio and Morningstar rating.  Take the Top 10 results  Generate HTML performance reports for the Top 10 funds. And they are:  Direxion Daily Real Estate Bear  AXS 2X NKE Bear Daily ETF  Direxion Daily 20Year Treasury  Direxion Shares ETF Trust Direx  Direxion Technology Bear 3X Sha  AXS 2X PFE Bear Daily ETF  AXS TSLA Bear Daily ETF Direxion Daily  TSLA Bear 1X Sha Direxion  Daily 10Yr Treasury B  Direxion Daily Samp;P 500 Bear 3X"
    ],
    "BAT": [
        "4 dividend stocks on my watchlist. cant buy em write about em I dont have any more capital to deploy right now but Im always looking for more stocks I want to add to my portfolio.  I currently have 25 and here are 4 more that I would seriously like to add as soon as my finances allow.  Many of you can probably relate I get a weird pleasure out of researching stocks talking about them and ultimately buying them.  And boy oh boy seeing that dividend come in is nice.  I feel like if I was a child with a lot of money I would buy dividend stocks  And I like to live my life like a big child while still being responsible of course.  Anyway since I cant afford to buy em right now Ill settle for sharing about them. This is not intended to be a comprehensive analysis of any of these.  Consider it an introduction to some names you may not have heard of and an opportunity to go do further research.  For those of you who are already familiar with the names it could be a good opportunity for discussion.  So without further ado heres the current list: 1. GGB  Gerdau SA.  Current Yield: 11.09% yields according to Yahoo Finance.  This is the newest one on my list I Just learned about it today after picking up some Petrobras PBR  also worth a look.  Theyre a multinational steel manufacturer headquartered in Brazil.  The 30th largest steel manufacturer in the world theyve been a business since 1901 and selling steel since 1948.   Free cash flow yield is nearly 30% and price to book is .97.  Debt does not appear to be an issue.  The business has been expanding rapidly over the past decade with a CAGR of 7.5%.  Even so the stock has underperformed Brazilian counterparts as well as the Russell 3000 over the last 5 years.  Im not sure why Mr. Market is pricing in such a discount more research would be required but I imagine theres emerging market risk as well as a predicted slowdown in steel on the horizon.  With such good numbers however Gerdau may be wellpositioned even in the face of a slowdown.  Geopolitical conditions may also provide tailwinds as the West seeks to lessen dependence on China. 2. QSR  Restaurant Brands International. Current Yield: 3.66%.  This is the corporation that owns Burger King Tim Hortons Popeyes and Firehouse Subs.  90% of revenues at the moment come from North America US and Canada but international is a big growth area for them.  They currently have over 28000 restaurants worldwide and are looking to grow to 40000.  Expansion is not their only avenue of growth revenue however.  Global samestore sales were up 9.1% as of last weeks earnings in part reflecting consumer trends as reflected in YUMs earnings.  BK international was up 10.3% in terms of samestore sales and things stabilized in the USA with BK samestore sales rising 4%.  BK gets a bad wrap in the USA but QSR has been undergoing a strategy to reinvigorate the business which seems to be at the very least leading to stabilization.  I personally live abroad and can attest to the fact that BK international is a popular business an observation that is reflected in the companys numbers.  Tims Popeyes and Firehouse also represent interesting growth opportunities abroad.  One risk to be aware of is the debt level  debt to EBIDTA is above 5 at the moment but interest coverage is strong at 3.9.  The business also generates strong free cash flow which is a good sign.  The business is also wellprotected from inflation risk as 57% of the mix is from rents and royalties collected from franchises.  Finally the company has been paying a growing and reliable dividend since inception.  Do note that at a PE of 22 and an EV / EBIDTA of 15 I would prefer to get it a little cheaper in spite of the growth prospects. 3. OHI  Omega Healthcare Investors. Current Yield: 8.52%.  This is a REIT that owns skilled nursing facilities 75% and senior housing 25% across the US and the UK.  Theres lots of tailwinds in this industry as the percentage of the US population aged 65 in 2020 was 17% and is predicted to increase to 22% by 2040.  This stock has been punished recently due to occupancy issues caused by the pandemic in fact 3 operators have failed to pay rent or to pay the full amount this last quarter  but the damage is less than 10% of annualized contractual rent and interest revenue.  OHI is currently undergoing a portfolio restructuring and in spite of the underlying issues the last quarter seemed to indicate some stability  AFFO per share of $0.76 remained unchanged from the previous quarter down from $0.85 in Q3 of last year.  The dividend coverage is razor thin right now at just over 97% but last year that figure was 85% and the company is assuring that resumed lease paying as well as the restructuring process will ensure dividend safety going forward.  Tailwinds to the industry in the longterm should also be taken into consideration despite shortterm issues related to the pandemic. 4. VGR  Vector Group.  Current Yield: 7.55%.  Vector Group owns the fourth largest tobacco company in the USA after PM USA MO Reynolds BTI and ITG IMBBY.  The company is focused on discount brands and has grown market share from just 1.2% in 1999 to a whopping 5.1% as of last quarter up from 4% in 2021.  This is in part due to Korean tobacco company KTG exiting the US market but also due to consumers downtrading thanks to inflation.  Its rare to see a tobacco company growing on volume rather than price/mix but Vector Group is doing it.  Debt is an issue with this company with a debt to EBIDTA of over 5x but interest coverage is 3.9x and the company generates massive free cash flow with an addictive product.  Management in the past has been questionable and the dividend was cut in 2020 due in part to the pandemic.  However the dividend looks much safer now with a 51% coverage for the year of 2021.  The company has no nextgeneration products vapes heated tobacco etc. but at least at present seems able to grow organically with traditional cigarettes.  I worry about this one decades down the line but for the time being I see it as a decent opportunity and even a different style of investment when compared to other tobacco companies like Altria and BAT.  At a PE ratio of just under 10 it is dirt cheap. Thats all folks hope you liked it and looking forward to the discussion.",
        "Investing directly into Corporate Bonds With all the talk of bond yields increasing Ive started to look into investing in corporate bonds. Ive come across this Bond issued by BAT British American Tobacco with a coupon of 6% a year and maturity of 2034 12 years from now. Currently the market price is 82  HL spread is rather big on this bond setting the bid price at 85 but Ive seen I can buy it on Interactive brokers at 82 so sticking with this price for calculation purposes. Ive worked it out to that over 12 years Id receive a payment of 6 per year with a final payment of the full coupon value of 100 on the 12th year. Overall I would achieve a return of 145% over 12 years if the coupon payment is reinvested each time it was paid assuming a 6% yield each year  see full calcs below: amp;x200B; Price82.00 ::: coupon %6%6 Face value of bond100 Current yield on market price:7% Time to maturity12 years  Total Coupon Payments =72.00 interest made on reinvestment of coupon payment assumed 6%pa29.22 Face value profit paid at end of maturity18.00 TOTAL:119.22  Total yield145.4% Annual yield =12.1% pa  Can anyone see any flaws in these calculations and any advice on doing this? currently the only downside I can see is that they go insolvent... Link to bond:  I note that Hargreaves requires a minimum 50k investment for this but this is fine. thanks"
    ],
    "USDC": [
        "Crypto hedge fund Three Arrows Capital has entered liquidation source says   LONDON June 29 Reuters  Crypto hedge fund Three Arrows Capital 3AC has entered liquidation a person familiar with the matter told Reuters on Wednesday in the latest sign of the market downturn hurting the crypto industry. Singaporebased 3AC is one of the higher profile crypto investors to have run into difficulties following the sharp selloff in the market for digital currencies seen in recent months. Crypto broker Voyager Digital issued 3AC with a default notice on Monday after it failed to make payments on a loan of 15250 bitcoin approximately $324 million and $350 million worth of USDC a stablecoin"
    ],
    "FTT": [
        "Binance announces noncontingent purchase of FTX Edit: deal is off The Tweet: gt; This afternoon FTX asked for our help. There is a significant liquidity crunch. To protect users we signed a nonbinding LOI intending to fully acquire  and help cover the liquidity crunch. We will be conducting a full DD in the coming days. I dont follow the space closely but from what I gather  Binance announced a few days ago they were selling FTX backed FTT because of issues at FTX causing a 30% crash of FTT  FTX CEO SBF oh my denied all this just yesterday  However reports of being unable to withdraw from FTX have started recently along with reports that FTX has a negative BTC balance  Binance is the 1 crypto exchange while FTX is 3 creating a mega exchange Coinbase is 2  To further add to the drama if its to be believed Binance worked with the FSB to provide data on Putin foe Alexei Navalny ",
        "FTX crypto exchange had a $25 billion valuation in Oct 21. Today it might actually be totally worthless after it collapsed virtually overnight. Once again it shows that sane level headed investors should stay far far away from anything crypto related. For those out of the loop. Binance is the no 1 largest crypto exchange in the world. FTX is or was the no 2 largest crypto exchange. FTX issues a shit coin called FTT. Binance held a very large amount of FTT because the crypto world is insanely incestuous CZ the CEO of Binance tweeted out that they would unwind the FTT position they held which was quite large because CZ said FTXs books were suspect. Sam Bankman Fraud Fried SBF  the CEO of FTX tweeted out that all was fine no problems they had the capital to back up FTT. A week later SBF admitted that FTX was insolvent and begged CZ to bail them out. CZ said Binance would absorb FTXs holdings. Then CZ got a look at the books and changed his mind letting FTX and SBF to twist in the wind. FTT was trading in the 30 dollar range last month now its worth $3 but you would be insane to buy it. If someone offered you the coins for free run. These valuations of crypto companies are fing insane. There is largely nothing there. EVery company and every crypto exchange is collateralized by buying and selling other crypto companies shit coins and imaginary crypto assets. Its all a big incestuous shell game and somehow Bloomberg and the entire financial press buys into it. Stay FAR FAR FAR away from crypto nonsense. Its chock full of thieves liars and con men. I mean a teacher union invested in this bulhit gt;Fortune: Tom Brady and other super wealthy investors lost big money in the FTX crypto collapse. Ontario Teachers Pension Plan also invested in FTX. "
    ],
    "NEXO": [
        "Is it true that a bank can pay 10% interest while being overcollateralized? Hi guys This is in reference to NEXO a crypto cefi bank that has managed to outlive Luna FTX and all the rest. They are the only company to have a daily attestation by an independent or accounting firm of 100% fully backed overcollateralized accounts. Meaning if everyone pulls out their money they would be able to meet depositors demands. I wonder however how can this be if they are paying up 10% interest on USD? What is the underlying economics behind this? Note: assume for the sake of argument that they were over collateralized. I dont want the non economic copout answer of its a scam."
    ]
}